{
  "backend/main.mo": "Motoko canister implementing core game backend logic including access control, player profiles, daily limits, AR spots, planted coins, monster capture, geolocation distance checks, and Stripe payment integration.",
  "CAPACITOR_BUILD_GUIDE.md": "Empty or placeholder document intended for Capacitor build instructions.",
  "CAPACITOR_MOBILE_GUIDE.md": "Empty or placeholder document intended for Capacitor mobile setup guidance.",
  "capacitor.config.ts": "Empty or placeholder Capacitor configuration file.",
  "DEEP_LINKING_SETUP.md": "Empty or placeholder document intended for deep linking configuration notes.",
  "feature_evidence.json": "Machine-readable feature evidence report mapping implemented features to frontend files, components, test requirements, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten high-level summaries of key frontend files, pages, hooks, and components for documentation and planning.",
  "frontend/index.html": "HTML entry point defining SEO metadata, Open Graph/Twitter tags, fonts, favicon, and mounting point for the React application.",
  "frontend/src/App.tsx": "Root React application configuring ThemeProvider and TanStack Router with all public routes, including the Treasury & Monetary Policy page.",
  "frontend/src/components/ARSpotModal.tsx": "Empty or placeholder component intended for AR spot interaction modal.",
  "frontend/src/components/BottomNav.tsx": "Empty or placeholder component intended for bottom navigation UI.",
  "frontend/src/components/CoinInfoBottomPanel.tsx": "Empty or placeholder component intended to display coin details in a bottom panel.",
  "frontend/src/components/CollectionCompleteBanner.tsx": "Empty or placeholder component intended to show collection completion feedback.",
  "frontend/src/components/EnergyBar.tsx": "Empty or placeholder component intended to visualize player energy status.",
  "frontend/src/components/Footer.tsx": "Footer component rendering branding, contact info, compliance text, and bilingual strings via LanguageContext.",
  "frontend/src/components/GameFooter.tsx": "Empty or placeholder component intended for in-game footer UI.",
  "frontend/src/components/Header.tsx": "Responsive global header with desktop and mobile navigation, language toggle (PT/EN), and TanStack Router links.",
  "frontend/src/components/LanguageToggle.tsx": "Empty or placeholder component intended for language switching UI.",
  "frontend/src/components/Layout.tsx": "App layout wrapper providing LanguageContext, header, footer, and routed content outlet.",
  "frontend/src/components/LegalModal.tsx": "Empty or placeholder component intended to display legal information in a modal.",
  "frontend/src/components/LoginButton.tsx": "Empty or placeholder component intended for authentication/login actions.",
  "frontend/src/components/MonsterDetailModal.tsx": "Empty or placeholder component intended to show detailed monster information.",
  "frontend/src/components/NearbyCoinsPanel.tsx": "Empty or placeholder component intended to list nearby coins.",
  "frontend/src/components/PlantConfirmationModal.tsx": "Empty or placeholder component intended to confirm token planting actions.",
  "frontend/src/components/PlantSuccessModal.tsx": "Empty or placeholder component intended to show successful planting feedback.",
  "frontend/src/components/PlayerHeader.tsx": "Empty or placeholder component intended to display player status and stats.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty or placeholder component intended for initial player profile setup.",
  "frontend/src/components/RescueConfirmationModal.tsx": "Empty or placeholder component intended to confirm rescue actions.",
  "frontend/src/components/ResgatarButton.tsx": "Empty or placeholder component intended for rescue/claim button functionality.",
  "frontend/src/components/TermsAndConditionsModal.tsx": "Empty or placeholder component intended to display terms and conditions.",
  "frontend/src/components/TokenInfoModal.tsx": "Empty or placeholder component intended to show detailed token metadata.",
  "frontend/src/components/WelcomeBonusBanner.tsx": "Empty or placeholder component intended to display a welcome bonus notification.",
  "frontend/src/contexts/LanguageContext.tsx": "Provides a React context for language selection (pt/en), persisted in localStorage, and exposes translated navigation and footer strings.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages a backend actor based on the current Internet Identity, handling anonymous vs authenticated actors and invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication provider and hook, managing login, logout, identity persistence, and detailed login status state via Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Empty hook file reserved for shared or custom React Query helpers.",
  "frontend/src/hooks/useSharedLocation.ts": "Empty hook file intended for shared location or routing state logic.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining a luxury black/gold design system, light and dark themes, typography, animations, and custom UI utilities.",
  "frontend/src/lib/capacitor-plugins.ts": "Empty library file intended for Capacitor plugin integrations.",
  "frontend/src/lib/deep-links.ts": "Empty utility file reserved for deep link handling logic.",
  "frontend/src/lib/offline-manager.ts": "Empty utility file intended for offline or caching management.",
  "frontend/src/main.tsx": "Application entry point that renders the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/AboutPage.tsx": "Multilingual marketing page describing the project vision, luxury branding, and global scope using rich visuals and iconography.",
  "frontend/src/pages/ARDistributionPage.tsx": "Page component displaying a multilingual overview of global AR spot distribution with maps, regional statistics, and styled visual sections.",
  "frontend/src/pages/ARMode.tsx": "Empty page file reserved for AR mode functionality.",
  "frontend/src/pages/BancoCentral.tsx": "Empty page file likely intended for central bank or monetary policy content.",
  "frontend/src/pages/Colecao.tsx": "Empty page file likely intended for a collection or NFT gallery feature.",
  "frontend/src/pages/ContactPage.tsx": "Multilingual contact and support page presenting helpdesk email and website links in a styled layout.",
  "frontend/src/pages/DAO.tsx": "Empty page file reserved for DAO governance content.",
  "frontend/src/pages/DAOPage.tsx": "Renders a bilingual DAO governance page describing a purely conceptual voting, treasury, and proposal system with strong legal disclaimers. Uses cards and icons to present non-functional, educational DAO content.",
  "frontend/src/pages/Distribuicao.tsx": "File exists but contains no implementation; likely a placeholder for a future distribution-related page.",
  "frontend/src/pages/GameSystemsPage.tsx": "Displays a bilingual overview of core game mechanics such as energy, XP, AR monster capture, and token planting/rescue limits. Content is static and informational.",
  "frontend/src/pages/GoldPaper.tsx": "Implements a large, scrollable bilingual 'Gold Paper' document covering executive summary, tokenomics, AR distribution, DAO, roadmap, presale, technical architecture, and legal sections.",
  "frontend/src/pages/HomePage.tsx": "Main animated hero page with language toggle, dynamic text effects, and install CTA linking to the external app. Focuses on branding, visuals, and first impression.",
  "frontend/src/pages/LandingPage.tsx": "Marketing-focused landing page with hero section, feature highlights, CTAs, and social links. Presents Quantumoney AR value proposition without language switching.",
  "frontend/src/pages/LegalPage.tsx": "Bilingual legal compliance page outlining GDPR, MiCA, KYC/AML, and risk disclaimers using icon-based cards. Content is static and informational.",
  "frontend/src/pages/MapMode.tsx": "File exists but has no content; likely intended for a future AR map or gameplay mode.",
  "frontend/src/pages/Perfil.tsx": "Empty file acting as a placeholder for a future user profile page.",
  "frontend/src/pages/Presale.tsx": "File exists with no implementation; appears to be an unused or legacy presale page.",
  "frontend/src/pages/PresalePage.tsx": "Bilingual presale overview page showing titles and static images for presale phases and progress dashboards. No interactive logic or transactions.",
  "frontend/src/pages/PreVendaQTM.tsx": "Empty file, likely reserved for a Portuguese-specific presale or QTM token presale page.",
  "frontend/src/pages/QTMRules.tsx": "Empty placeholder file likely intended for rules or terms related to QTM/QMY.",
  "frontend/src/pages/QueimaDeflacao.tsx": "Empty file, presumably reserved for future content about token burn and deflation mechanics.",
  "frontend/src/pages/RoadmapPage.tsx": "Renders a multilingual 2026 roadmap page showing quarterly milestones with styled cards and icons, driven by language context.",
  "frontend/src/pages/SwapQTMICP.tsx": "File is present but contains no implementation or exported logic.",
  "frontend/src/pages/TechnicalPage.tsx": "Displays a bilingual technical architecture overview describing the ICP/Motoko backend and React/TypeScript frontend stack.",
  "frontend/src/pages/TokenomicsPage.tsx": "Implements an interactive tokenomics page showing total supply and token distribution allocations with hover effects and multilingual content.",
  "frontend/src/pages/TreasuryMonetaryPolicyPage.tsx": "Provides a detailed, multilingual conceptual overview of DAO treasury management, vesting, deflationary policy, timelines, and regulatory compliance with strong non-execution disclaimers.",
  "frontend/src/pages/Tutorial.tsx": "File is present but contains no implementation or exported logic.",
  "frontend/src/pages/VestingDeflationPage.tsx": "Shows a bilingual informational page illustrating vesting schedules and deflation mechanics using charts and icon-based cards.",
  "frontend/src/pages/VestingQTM.tsx": "File is present but contains no implementation or exported logic.",
  "frontend/src/utils/bigint.ts": "File is present but contains no implementation or exported logic.",
  "frontend/src/utils/distance.ts": "File is present but contains no implementation or exported logic.",
  "frontend/src/utils/urlParams.ts": "Defines utility functions for reading, persisting, and clearing URL and hash parameters with sessionStorage support for routing state.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, content paths, container settings, custom fonts, OKLCH-based luxury color palette, shadows, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata and state file describing scope, compliance constraints (MiCA/GDPR), phased documentation approach, and a catalog of existing frontend features and pages.",
  "public/.well-known/apple-app-site-association": "Apple App Site Association file placeholder, used to configure iOS universal links and app-domain association.",
  "public/.well-known/assetlinks.json": "Android Digital Asset Links file placeholder, used to associate the web domain with an Android application for deep linking.",
  "scripts/build-mobile.sh": "Shell script placeholder intended for building or packaging the mobile application or related assets.",
  "scripts/test-mobile.sh": "Shell script placeholder intended for running tests or validation for the mobile build or environment."
}