{
  "backend/main.mo": "Main Motoko canister defining player profiles, AR spots, daily limits, chat, QMY purchases, and Stripe integration with access control.",
  "CAPACITOR_BUILD_GUIDE.md": "Empty placeholder guide file.",
  "CAPACITOR_MOBILE_GUIDE.md": "Empty placeholder mobile guide file.",
  "capacitor.config.ts": "Empty Capacitor config file.",
  "DEEP_LINKING_SETUP.md": "Empty deep linking setup file.",
  "feature_evidence.json": "Feature evidence report linking specific patches to affected frontend files and components.",
  "frontend-file-summaries.txt": "Generated summaries describing key frontend components, pages, and styling utilities.",
  "frontend/index.html": "Main HTML entry with meta tags, fonts, and app root mounting point.",
  "frontend/src/App.tsx": "App router setup with all routes, providers, and page components registered.",
  "frontend/src/components/ARSpotModal.tsx": "Empty component file.",
  "frontend/src/components/BottomNav.tsx": "Empty component file.",
  "frontend/src/components/CoinInfoBottomPanel.tsx": "Empty component file.",
  "frontend/src/components/CollectionCompleteBanner.tsx": "Empty component file.",
  "frontend/src/components/Container.tsx": "Reusable layout container component with configurable max-width sizes.",
  "frontend/src/components/CookieConsentBanner.tsx": "Cookie consent banner with delayed appearance, accept handling, and privacy policy link.",
  "frontend/src/components/EnergyBar.tsx": "Empty component file.",
  "frontend/src/components/Footer.tsx": "Renders a multi-column footer with branding, navigation links, and legal sections.",
  "frontend/src/components/GameFooter.tsx": "Empty component file.",
  "frontend/src/components/gold-paper/GoldPaperUniverseVisualization.tsx": "Interactive visualization of global QMY hotspots with selectable details and regional breakdown display.",
  "frontend/src/components/Header.tsx": "Defines the main site header with navigation, branding, and a responsive mobile menu.",
  "frontend/src/components/InstitutionalExpansionSection.tsx": "Provides a styled section wrapper with multilingual conceptual disclaimers and content slots.",
  "frontend/src/components/LanguageToggle.tsx": "Empty component file.",
  "frontend/src/components/Layout.tsx": "Defines the global page layout with header, footer, lazy-loaded scene, and routed content.",
  "frontend/src/components/LegalModal.tsx": "Empty component file.",
  "frontend/src/components/LoginButton.tsx": "Handles Internet Identity login/logout with status display and button styling.",
  "frontend/src/components/MonsterDetailModal.tsx": "Empty component file.",
  "frontend/src/components/NearbyCoinsPanel.tsx": "Empty component file.",
  "frontend/src/components/PageShell.tsx": "Simple wrapper adding top padding and full-height layout for pages.",
  "frontend/src/components/PlantConfirmationModal.tsx": "Empty component file.",
  "frontend/src/components/PlantSuccessModal.tsx": "Empty component file.",
  "frontend/src/components/PlayerHeader.tsx": "Empty component file.",
  "frontend/src/components/presale/PresaleLotsExplorer.tsx": "Explorer UI for presale phases showing allocation, pricing, bonuses, and phase status with selectable tabs.",
  "frontend/src/components/presale/PresaleUnlockVisualization.tsx": "Displays a vesting timeline with monthly unlock amounts and cumulative percentage progress.",
  "frontend/src/components/profile/ProfileGlassPanel.tsx": "Wrapper panel component providing glass-style card layout for profile sections.",
  "frontend/src/components/profile/ProfileHudOverlay.tsx": "Fixed HUD overlay showing live player profile stats such as nickname, energy, XP, and tokens.",
  "frontend/src/components/profile/ProfilePlaceholders.tsx": "Placeholder panels for upcoming profile modules like monsters, activity, and quick actions.",
  "frontend/src/components/profile/useProfileModuleState.ts": "Hook computing authentication, registration, and profile setup visibility state.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty component file.",
  "frontend/src/components/quantum/QuantumUniverseScene.tsx": "Three.js scene rendering animated quantum particles, a field ring, and star background for ambiance.",
  "frontend/src/components/ReadOnlyBanner.tsx": "Displays a read-only warning banner with customizable message.",
  "frontend/src/components/RescueConfirmationModal.tsx": "Empty component file.",
  "frontend/src/components/ResgatarButton.tsx": "Empty component file.",
  "frontend/src/components/SectionNavigator.tsx": "Full-screen navigation overlay listing site sections with availability indicators.",
  "frontend/src/components/StatusBadge.tsx": "Renders a status badge with icon and color coding for draft, planned, or coming-soon states.",
  "frontend/src/components/TermsAndConditionsModal.tsx": "Empty component file.",
  "frontend/src/components/TokenInfoModal.tsx": "Empty component file.",
  "frontend/src/components/Typography.tsx": "Provides styled typography components for titles and body text.",
  "frontend/src/components/wallet/QMYTransactionHistory.tsx": "Renders transaction history UI with loading, error, unsupported, empty, and populated states, including icons for different transaction types.",
  "frontend/src/components/wallet/SendQMYSimulatedCard.tsx": "Provides a simulated QMY send form with validation, toast notifications, and API simulation handling.",
  "frontend/src/components/wallet/VestingBreakdown.tsx": "Displays vesting info including available/locked amounts, progress bar, and countdown to next unlock.",
  "frontend/src/components/WelcomeBonusBanner.tsx": "Empty component file.",
  "frontend/src/contexts/LanguageContext.tsx": "Implements language context with translation support, persisted in localStorage for English and Portuguese.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to identity, invalidating dependent queries when the actor updates.",
  "frontend/src/hooks/useCookieConsent.ts": "Manages cookie consent state with localStorage persistence.",
  "frontend/src/hooks/useDao.ts": "Provides DAO proposal fetching, creation, and voting using simulated in-memory stores and identity-aware logic.",
  "frontend/src/hooks/useICPLedger.ts": "Fetches authenticated ICP balance from the on-chain ledger using an HttpAgent and ICP ledger client.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, managing identity state and login flows.",
  "frontend/src/hooks/useLuxuryBank.ts": "Fetches and derives mock luxury bank metrics, time series, and category breakdown data using a canister actor.",
  "frontend/src/hooks/usePublicChat.ts": "Implements local-only public chat state with message sending simulation and basic message storage.",
  "frontend/src/hooks/useQMYLedger.ts": "Fetches authenticated QMY ledger balance and formatting via an ICRC ledger client.",
  "frontend/src/hooks/useQMYTransactions.ts": "Retrieves authenticated QMY transaction history from the ICRC ledger.",
  "frontend/src/hooks/useQMYVesting.ts": "Returns null vesting info, indicating vesting data is not available on-chain.",
  "frontend/src/hooks/useQueries.ts": "Provides react-query hooks for user profiles, player registration, and player state via the canister actor.",
  "frontend/src/hooks/useSharedLocation.ts": "Empty placeholder file.",
  "frontend/src/hooks/useSimulatedQMYVesting.ts": "Calculates simulated vesting data based on stored start date and allows toggling the simulation state.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, and utility classes including glass and QMY-themed styles.",
  "frontend/src/lib/bank/luxuryDerivations.ts": "Utility functions for percentage change, currency/number formatting, and generating sparkline path data.",
  "frontend/src/lib/capacitor-plugins.ts": "Empty placeholder file.",
  "frontend/src/lib/dao/preProposalsData.ts": "Contains static DAO pre-proposal definitions with metadata and detailed sections.",
  "frontend/src/lib/deep-links.ts": "Empty placeholder file.",
  "frontend/src/lib/icp/account.ts": "Implements ICP account identifier derivation using a custom SHA-224 stub and CRC32 checksum.",
  "frontend/src/lib/icp/ledgerClient.ts": "Provides a client for querying ICP balances via the ledger canister and includes balance formatting utilities.",
  "frontend/src/lib/icrc/icrc.idl.ts": "Defines the IDL interface for ICRC-1 ledger queries including metadata and balance functions.",
  "frontend/src/lib/icrc/ledgerClient.ts": "Implements an ICRC-1 ledger client for metadata and balance queries with formatting helpers.",
  "frontend/src/lib/icrc/transactions.ts": "Attempts to query ICRC-1 transaction history and parses responses, returning null if unsupported.",
  "frontend/src/lib/map/mapDatasets.ts": "Contains predefined map marker datasets for coins and monsters with coordinates and names.",
  "frontend/src/lib/map/simulatedMapProjection.ts": "Provides a simple equirectangular projection converting latitude/longitude to screen coordinates.",
  "frontend/src/lib/offline-manager.ts": "Empty placeholder file for offline management logic.",
  "frontend/src/lib/qmy/centralBankSimData.ts": "Provides simulated central bank statistics including supply, usage, presale, and regional data.",
  "frontend/src/lib/qmy/goldPaperSimData.ts": "Returns simulated hotspot and regional allocation data for Gold Paper distribution.",
  "frontend/src/lib/qmy/presaleSimData.ts": "Supplies mock presale phase data including allocations, pricing, bonuses, and status.",
  "frontend/src/lib/qmy/simulatedSend.ts": "Simulates sending tokens with validation and random success/failure for testing.",
  "frontend/src/lib/qmy/simulatedVesting.ts": "Calculates vesting progress over time and determines next unlock amount and date.",
  "frontend/src/main.tsx": "Application entry point initializing React, QueryClient, Internet Identity provider, and rendering App.",
  "frontend/src/pages/AboutPage.tsx": "About page outlining project documentation sections and ecosystem overview with placeholders.",
  "frontend/src/pages/ARDistributionPage.tsx": "Static conceptual AR distribution page with disclaimers and compliance notices.",
  "frontend/src/pages/ARMode.tsx": "Placeholder AR mode page showing a coming-soon card within a basic layout.",
  "frontend/src/pages/BancoCentral.tsx": "Simulated luxury bank dashboard displaying token metrics, charts, and KPIs using fetched data.",
  "frontend/src/pages/Colecao.tsx": "Empty page file with no implemented content.",
  "frontend/src/pages/ContactPage.tsx": "Localized contact page showing helpdesk email and website links for support.",
  "frontend/src/pages/DAO.tsx": "Empty DAO page file with no implemented content.",
  "frontend/src/pages/DAOCreateProposalPage.tsx": "Form page for authenticated, registered users to create DAO proposals with validation and navigation.",
  "frontend/src/pages/DAOPage.tsx": "DAO governance overview listing proposals with access control for authentication and registration.",
  "frontend/src/pages/DAOProposalDetailPage.tsx": "Displays proposal details with voting, revoking votes, and navigation back to the DAO list using hooks and UI components.",
  "frontend/src/pages/Distribuicao.tsx": "Empty placeholder page with no implemented content.",
  "frontend/src/pages/DocsPage.tsx": "Renders a documentation hub with categorized sections, status badges, and an educational disclaimer.",
  "frontend/src/pages/GameSystemsPage.tsx": "Shows AR game mechanics, disclaimers, and future sync notes with language‑based content switching.",
  "frontend/src/pages/GoldPaper.tsx": "Displays the Gold Paper draft with disclaimers, table of contents, and structured conceptual documentation sections.",
  "frontend/src/pages/HomePage.tsx": "Landing page with animated visuals, language toggle, rotating text, and a CTA linking to the AR app.",
  "frontend/src/pages/LandingPage.tsx": "Renders the landing page with a hero section, branding visuals, CTA, and a features grid. Uses animated UI components and themed styling.",
  "frontend/src/pages/LegalPage.tsx": "Displays multilingual legal and compliance information, including disclaimers, GDPR details, and regulatory notices. Content is selected based on current language.",
  "frontend/src/pages/MapMode.tsx": "Shows a simulated world map with controls for adjusting center and zoom. Displays QMY coin and monster marker locations using a custom projection.",
  "frontend/src/pages/Perfil.tsx": "Provides profile authentication, registration, and editing flows using Internet Identity. Manages nickname updates and displays profile state with UI panels.",
  "frontend/src/pages/PreProposalDetailPage.tsx": "Fetches and displays details of a selected pre-proposal, including description, objective, impact, and full sections. Provides navigation back to the proposal list.",
  "frontend/src/pages/PreProposalsPage.tsx": "Renders a list of educational pre-proposals with details and navigation to individual proposal pages.",
  "frontend/src/pages/Presale.tsx": "Empty placeholder page file.",
  "frontend/src/pages/PresalePage.tsx": "Displays simulated presale data including allocation, phases, vesting, and visual explorers.",
  "frontend/src/pages/PreVendaQTM.tsx": "Empty placeholder page file.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Shows a full privacy policy with sections on data collection, usage, protection, and user rights.",
  "frontend/src/pages/PublicChatPage.tsx": "Implements a simulated session-only public chat with message input, validation, and display.",
  "frontend/src/pages/QMYTokenPage.tsx": "Presents QMY token features and token information in a styled informational layout.",
  "frontend/src/pages/QTMRules.tsx": "Placeholder page for QTM game rules with a coming-soon message.",
  "frontend/src/pages/QueimaDeflacao.tsx": "Empty placeholder page file.",
  "frontend/src/pages/RoadmapPage.tsx": "Displays a conceptual roadmap with disclaimers, draft phases, and regulatory notes, emphasizing no commitments or operational promises.",
  "frontend/src/pages/SwapPage.tsx": "Renders a swap feature placeholder with authentication checks, a read‑only banner, and UI indicating the swap system is coming soon.",
  "frontend/src/pages/SwapQTMICP.tsx": "Empty placeholder file for a future QTM–ICP swap page.",
  "frontend/src/pages/TechnicalPage.tsx": "Shows multilingual technical architecture details, listing canisters, compliance notes, and conceptual-only system explanations.",
  "frontend/src/pages/TermsOfServicePage.tsx": "Presents the Terms of Service with sections on eligibility, user accounts, acceptable use, liability limits, and content ownership.",
  "frontend/src/pages/TokenomicsPage.tsx": "Provides a conceptual tokenomics overview with strong disclaimers and draft sections describing non-operational token models.",
  "frontend/src/pages/TreasuryMonetaryPolicyPage.tsx": "Outlines a conceptual treasury and monetary policy framework with compliance notices and draft, non-operational content.",
  "frontend/src/pages/Tutorial.tsx": "Empty placeholder file for a future tutorial page.",
  "frontend/src/pages/VestingDeflationPage.tsx": "Renders a bilingual vesting and deflation info page with icons and two image sections.",
  "frontend/src/pages/VestingQTM.tsx": "Empty placeholder page with no implementation.",
  "frontend/src/pages/WalletPage.tsx": "Displays a wallet dashboard with authentication handling, balances, vesting data, and transaction history.",
  "frontend/src/utils/bigint.ts": "Empty utility file with no content.",
  "frontend/src/utils/distance.ts": "Empty utility file with no content.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/src/VALIDATION_REQUIRED.md": "Notes on institutional-safe build, completed changes, constraints, and next validation steps.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, sizes, shadows, and animations for the project.",
  "project_state.json": "Project state metadata describing patch requirements, known issues, and feature tracking.",
  "public/.well-known/apple-app-site-association": "Empty configuration file for Apple app site association.",
  "public/.well-known/assetlinks.json": "Empty Android asset links configuration file.",
  "scripts/build-mobile.sh": "Empty mobile build script.",
  "scripts/test-mobile.sh": "Empty mobile test script."
}