{
  "backend/main.mo": "Main Motoko actor implementing game backend with player profiles, energy/XP/tokens, monster capture, coin planting/rescue with daily limits, AR spot claims, chat, DAO proposals, Stripe integration, and access control.",
  "CAPACITOR_BUILD_GUIDE.md": "Empty file, no content.",
  "CAPACITOR_MOBILE_GUIDE.md": "Empty file, no content.",
  "capacitor.config.ts": "Empty file, no content.",
  "DEEP_LINKING_SETUP.md": "Empty file, no content.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including Profile page with AR game data sync, XP/coin/monster display, dynamic styling, and associated test IDs and components.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of frontend files including App.tsx with routing, pages for map/AR/bank/DAO/profile, modals for planting/rescue/tokens, navigation components, and styling with OKLCH color system.",
  "frontend/index.html": "HTML entry point with Quantumoney.app metadata, SEO tags, Open Graph/Twitter cards, viewport configuration for mobile safe areas, and Google Fonts preconnect.",
  "frontend/src/App.tsx": "Main React app with TanStack Router setup, QueryClient provider, theme/language contexts, and routes for home, wallet, swap, DAO, profile (/profile and /perfil), map, presale, and institutional pages.",
  "frontend/src/components/ARSpotModal.tsx": "Empty file, no content.",
  "frontend/src/components/BottomNav.tsx": "Empty file, no content.",
  "frontend/src/components/CoinInfoBottomPanel.tsx": "Empty file, no content.",
  "frontend/src/components/CollectionCompleteBanner.tsx": "Empty file, no content.",
  "frontend/src/components/Container.tsx": "Reusable container component with configurable max-width sizes (sm/md/lg/xl/full) and responsive padding.",
  "frontend/src/components/CookieConsentBanner.tsx": "Fixed bottom banner with cookie consent UI, accept/learn-more buttons, links to privacy policy, and fade-in animation using useCookieConsent hook.",
  "frontend/src/components/EnergyBar.tsx": "Empty file, no content.",
  "frontend/src/components/Footer.tsx": "Footer component with logo, navigation links organized in columns (Resources, Governance, Legal), social media icons, and copyright information.",
  "frontend/src/components/GameFooter.tsx": "Empty file with no content.",
  "frontend/src/components/gold-paper/GoldPaperUniverseVisualization.tsx": "Displays an interactive global distribution map for 600M QMY tokens across hotspots with animated stars, showing regional allocations and coordinates when a hotspot is selected.",
  "frontend/src/components/Header.tsx": "Fixed header component with logo, desktop navigation menu, mobile hamburger menu, and LoginButton integration.",
  "frontend/src/components/InstitutionalExpansionSection.tsx": "Wrapper component that displays a prominent disclaimer banner (MiCA/GDPR compliance) above conceptual institutional content, with bilingual support (PT/EN).",
  "frontend/src/components/LanguageToggle.tsx": "Empty file with no content.",
  "frontend/src/components/Layout.tsx": "Root layout component that renders Header, Footer, CookieConsentBanner, lazy-loaded QuantumUniverseScene background, and Outlet for child routes.",
  "frontend/src/components/LegalModal.tsx": "Empty file with no content.",
  "frontend/src/components/LoginButton.tsx": "Button component for Internet Identity authentication that displays login/logout states with principal truncation and loading indicators.",
  "frontend/src/components/MonsterDetailModal.tsx": "Empty file with no content.",
  "frontend/src/components/NearbyCoinsPanel.tsx": "Empty file with no content.",
  "frontend/src/components/PageShell.tsx": "Simple wrapper component that adds minimum height and top padding to page content.",
  "frontend/src/components/PlantConfirmationModal.tsx": "Empty file with no content.",
  "frontend/src/components/PlantSuccessModal.tsx": "Empty file with no content.",
  "frontend/src/components/PlayerHeader.tsx": "Empty file with no content.",
  "frontend/src/components/presale/PresaleLotsExplorer.tsx": "Provides a tabbed interface to explore presale phases, displaying allocation, price per token, bonus percentage, and minimum purchase for each phase with status badges.",
  "frontend/src/components/presale/PresaleUnlockVisualization.tsx": "Visualizes token unlock schedule over a vesting period with a timeline showing monthly unlock amounts and cumulative percentage unlocked.",
  "frontend/src/components/profile/ARCoinBalance.tsx": "Displays user's QTM coin balance broken down into available, locked, and bonus coins with a 3D coin icon and styled cards.",
  "frontend/src/components/profile/ARMonsterCollection.tsx": "Shows a grid of captured AR monsters with icons, capture dates, and energy boosts; displays empty state if no monsters are captured.",
  "frontend/src/components/profile/ARPlayerStats.tsx": "Displays player XP, current level, and progress bar toward the next level with trophy and XP icons.",
  "frontend/src/components/profile/ProfileGlassPanel.tsx": "A reusable glass-morphism styled card wrapper component for profile sections.",
  "frontend/src/components/profile/ProfileHudOverlay.tsx": "Fixed overlay HUD in the top-right corner showing real-time player stats including nickname, energy, XP, level, and token balances.",
  "frontend/src/components/profile/ProfilePlaceholders.tsx": "Renders three placeholder cards (Captured Monsters, Recent Activity, Quick Actions) with icons and \"Coming soon\" labels for future profile features.",
  "frontend/src/components/profile/useProfileModuleState.ts": "Custom hook that derives authentication and registration state from identity and profile data, determining whether to show profile setup UI.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty file with no content.",
  "frontend/src/components/quantum/QuantumUniverseScene.tsx": "Three.js/React Three Fiber component rendering an animated 3D background with quantum-themed particles, stars, and a pulsing torus field with gold/amber/violet colors.",
  "frontend/src/components/ReadOnlyBanner.tsx": "Banner component that displays a lock icon and message indicating read-only mode with disabled transfer/swap functionality.",
  "frontend/src/components/RescueConfirmationModal.tsx": "Empty file with no content.",
  "frontend/src/components/ResgatarButton.tsx": "Empty file with no content.",
  "frontend/src/components/SectionNavigator.tsx": "Full-screen overlay navigation menu with grid layout showing all app sections with icons, labels, and availability badges.",
  "frontend/src/components/StatusBadge.tsx": "Badge component that displays status indicators (draft, planned, coming-soon) with corresponding icons and styling.",
  "frontend/src/components/TermsAndConditionsModal.tsx": "Empty file with no content.",
  "frontend/src/components/TokenInfoModal.tsx": "Empty file with no content.",
  "frontend/src/components/Typography.tsx": "Reusable typography components (PageTitle, SectionTitle, SubsectionTitle, BodyText) with consistent styling and optional icon support.",
  "frontend/src/components/wallet/QMYTransactionHistory.tsx": "Displays QMY token transaction history in a card with loading, error, empty, and unsupported states, showing transaction icons based on type (transfer, mint, burn).",
  "frontend/src/components/wallet/SendQMYSimulatedCard.tsx": "Form component for simulating QMY token transfers with destination principal and amount inputs, validation, and toast notifications for success/failure.",
  "frontend/src/components/wallet/VestingBreakdown.tsx": "Displays token vesting information with available/locked balances, progress bar, and countdown timer for next unlock event.",
  "frontend/src/components/WelcomeBonusBanner.tsx": "Empty file with no content.",
  "frontend/src/contexts/LanguageContext.tsx": "React context providing i18n support for Portuguese and English with localStorage persistence and translation function for navigation and footer strings.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend canister actor with Internet Identity authentication, automatically invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useARGameData.ts": "Fetches AR game player profile data (XP, level, coins, captured monsters) from multiple AR game canisters using Internet Identity authentication and returns it via React Query.",
  "frontend/src/hooks/useCookieConsent.ts": "Manages cookie consent state in localStorage with functions to give and revoke consent.",
  "frontend/src/hooks/useDao.ts": "Provides DAO proposal management with in-memory storage for creating, fetching, and voting on proposals (simulated implementation pending canister integration).",
  "frontend/src/hooks/useICPLedger.ts": "Fetches real ICP balance from the on-chain ledger using authenticated identity and returns formatted balance data.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login/logout functionality, identity state management, and AuthClient configuration.",
  "frontend/src/hooks/useLuxuryBank.ts": "Fetches and derives luxury bank dashboard data including token supply, distribution breakdown, time series, and metrics from the backend actor.",
  "frontend/src/hooks/usePublicChat.ts": "Manages local in-memory public chat messages with send functionality (simulated implementation with local state).",
  "frontend/src/hooks/useQMYLedger.ts": "Fetches real QMY token balance from the ICRC ledger canister using authenticated identity and returns formatted balance with metadata.",
  "frontend/src/hooks/useQMYTransactions.ts": "Fetches QMY transaction history from the ICRC ledger canister for the authenticated user's principal.",
  "frontend/src/hooks/useQMYVesting.ts": "Hook for QMY vesting information that currently returns null as vesting data is not exposed on-chain.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating player profile data, including getting/saving caller profile, registering players, and polling player state with 3-second intervals.",
  "frontend/src/hooks/useSharedLocation.ts": "Empty file with no content.",
  "frontend/src/hooks/useSimulatedQMYVesting.ts": "Custom hook that manages simulated QMY token vesting state in localStorage, calculating available/locked tokens and next unlock times based on a start date.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens for dark theme using OKLCH color space, plus utility classes for safe areas, glass effects, and QMY-specific styling.",
  "frontend/src/lib/bank/luxuryDerivations.ts": "Utility functions for financial data formatting including percentage change calculation, currency formatting, large number abbreviation, and SVG sparkline path generation.",
  "frontend/src/lib/capacitor-plugins.ts": "Empty file with no content.",
  "frontend/src/lib/dao/preProposalsData.ts": "Defines PreProposal interface and exports mock DAO governance proposals covering treasury allocation, AR distribution, vesting schedules, and developer grants.",
  "frontend/src/lib/deep-links.ts": "Empty file with no content.",
  "frontend/src/lib/icp/account.ts": "Implements ICP account identifier derivation from principals using SHA-224 hashing and CRC32 checksums, with a development-only hash implementation.",
  "frontend/src/lib/icp/ledgerClient.ts": "ICP Ledger client for querying account balances on mainnet, including balance formatting from e8s to ICP with proper decimal handling.",
  "frontend/src/lib/icrc/icrc.idl.ts": "Candid IDL factory defining ICRC-1 token standard interface for querying name, symbol, decimals, balance, and metadata.",
  "frontend/src/lib/icrc/ledgerClient.ts": "ICRC-1 token ledger client for read-only queries including metadata fetching, balance checking, and formatting token amounts with proper decimal handling.",
  "frontend/src/lib/icrc/transactions.ts": "Queries ICRC-1 transaction history for an account with graceful fallback when the optional transactions method is not supported by the ledger.",
  "frontend/src/lib/map/mapDatasets.ts": "Defines map marker interfaces and exports hardcoded arrays of coin and monster markers with geographic coordinates for landmarks worldwide.",
  "frontend/src/lib/map/simulatedMapProjection.ts": "Implements an equirectangular map projection function that converts latitude/longitude to x/y screen coordinates with zoom and center support.",
  "frontend/src/lib/offline-manager.ts": "Empty file with no content.",
  "frontend/src/lib/qmy/centralBankSimData.ts": "Provides simulated central bank data including token supply, distribution categories, usage metrics, presale info, and geographic breakdown.",
  "frontend/src/lib/qmy/goldPaperSimData.ts": "Defines interfaces and returns simulated gold paper distribution data with hotspots at global landmarks and regional allocation breakdowns.",
  "frontend/src/lib/qmy/presaleSimData.ts": "Provides simulated presale data with three phases (seed, private, public) including allocation, pricing, bonuses, and status information.",
  "frontend/src/lib/qmy/simulatedSend.ts": "Simulates token sending with validation for principal format, amount, and balance, returning success or error after a delay.",
  "frontend/src/lib/qmy/simulatedVesting.ts": "Calculates vesting schedule with 30-day unlock periods, tracking available and locked tokens plus next unlock date and amount.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AboutPage.tsx": "About page explaining the Quantumoney ecosystem with separate institutional documentation and AR gaming platforms, including compliance notices.",
  "frontend/src/pages/ARDistributionPage.tsx": "Displays a conceptual AR distribution model page with compliance notices emphasizing no active token distribution is occurring.",
  "frontend/src/pages/ARMode.tsx": "Placeholder page for AR mode functionality with a camera icon and 'coming soon' message.",
  "frontend/src/pages/BancoCentral.tsx": "Luxury bank dashboard page displaying comprehensive QMY token metrics including supply, circulation, locked tokens, and analytics with charts (content truncated).",
  "frontend/src/pages/Colecao.tsx": "Empty file with no content.",
  "frontend/src/pages/ContactPage.tsx": "Contact page displaying helpdesk email and website URL with bilingual support (PT/EN) and styled cards with Globe2 icons.",
  "frontend/src/pages/DAO.tsx": "Empty file with no content.",
  "frontend/src/pages/DAOCreateProposalPage.tsx": "Form page for creating DAO proposals with authentication and registration checks, title/description inputs, and submission handling via useCreateProposal hook.",
  "frontend/src/pages/DAOPage.tsx": "DAO governance overview page displaying active proposals list with authentication/registration guards and navigation to create or view individual proposals.",
  "frontend/src/pages/DAOProposalDetailPage.tsx": "Detailed proposal view page showing title, author, vote counts, and voting buttons (yes/no/abstain) with vote revocation functionality.",
  "frontend/src/pages/Distribuicao.tsx": "Empty file with no content.",
  "frontend/src/pages/DocsPage.tsx": "Documentation hub landing page displaying a grid of doc sections (Gold Paper, Tokenomics, Technical, Roadmap, DAO, Treasury, Vesting, Legal, Contact) with status badges and educational disclaimer.",
  "frontend/src/pages/GameSystemsPage.tsx": "Game mechanics documentation page describing AR game features (energy, XP, monster capture, token planting/rescuing) with bilingual content and disclaimers about separation from institutional site.",
  "frontend/src/pages/GoldPaper.tsx": "Displays the Quantumoney Gold Paper, an institutional/educational document outlining the QMY ecosystem's conceptual framework with sections on vision, tokenomics, governance, and compliance. Includes a universe visualization component and emphasizes that no tokens are issued and content is informational only.",
  "frontend/src/pages/HomePage.tsx": "Main landing page featuring an animated quantum galaxy background, QMY logo with gold glow effects, language toggle (PT/EN), and a CTA button to install the app. Includes animated stars, nebula effects, and cycling promotional text.",
  "frontend/src/pages/LandingPage.tsx": "Alternative landing page with hero section showcasing Quantumoney as a Web3 quantum universe application on Internet Computer. Features core functionality cards (Wallet, Repeat, Coins) with hover effects and glass-card styling.",
  "frontend/src/pages/LegalPage.tsx": "Bilingual (PT/EN) legal compliance page detailing regulatory notices including MiCA and GDPR compliance, clarifying that QMY is not a financial product, no tokens are issued, and explaining data protection policies with contact information.",
  "frontend/src/pages/MapMode.tsx": "Interactive global map visualization showing simulated QMY coin and monster locations at famous landmarks worldwide. Includes map controls for adjusting center coordinates and zoom level with SVG-based projection rendering.",
  "frontend/src/pages/Perfil.tsx": "User profile page that handles authentication, profile creation/editing with nickname, and displays player state using Internet Identity and various profile components.",
  "frontend/src/pages/PreProposalDetailPage.tsx": "Displays detailed view of a single pre-proposal including description, objective, impact, and full details sections with navigation back to the pre-proposals list.",
  "frontend/src/pages/PreProposalsPage.tsx": "Lists all educational pre-proposals for community review with cards showing title, description, objective, and impact, emphasizing these are informational only without governance actions.",
  "frontend/src/pages/Presale.tsx": "Empty file with no content.",
  "frontend/src/pages/PresalePage.tsx": "Displays simulated QMY token presale information including total allocation, phases, vesting period, with components for exploring lots and unlock visualization, clearly marked as informational/educational only.",
  "frontend/src/pages/PreVendaQTM.tsx": "Empty file with no content.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Privacy policy page in Portuguese explaining data collection, usage, storage, user rights, GDPR/LGPD compliance, and policies for children's privacy and location/camera usage.",
  "frontend/src/pages/ProfilePage.tsx": "Displays user profile with AR game data (stats, coin balance, monster collection) when authenticated via Internet Identity. Shows login prompt or loading state when not authenticated or data is loading.",
  "frontend/src/pages/PublicChatPage.tsx": "Implements a session-only public chat interface with message display and submission form. Messages are stored in memory only and not persisted across sessions or users.",
  "frontend/src/pages/QMYTokenPage.tsx": "Informational page describing the QMY token, its key features (real token, swappable, secure, decentralized), and token details including symbol, network, and authentication method.",
  "frontend/src/pages/QTMRules.tsx": "Placeholder page for QTM game rules and guidelines with a simple card layout indicating content is coming soon.",
  "frontend/src/pages/QueimaDeflacao.tsx": "Empty file with no content.",
  "frontend/src/pages/RoadmapPage.tsx": "Displays a conceptual roadmap with prominent disclaimers stating no commitments or guarantees are made, emphasizing regulatory compliance (MiCA, GDPR) and educational purpose only.",
  "frontend/src/pages/SwapPage.tsx": "Swap page requiring Internet Identity authentication that displays a \"Coming Soon\" message with read-only banner, indicating QMY ↔ ICP swap functionality is under development.",
  "frontend/src/pages/SwapQTMICP.tsx": "Empty file with no content.",
  "frontend/src/pages/TechnicalPage.tsx": "Displays the technical architecture of the Quantumoney platform, listing canister IDs for frontend, docs, QMY logic, and governance with disclaimers that components are visual/institutional only with no crypto execution.",
  "frontend/src/pages/TermsOfServicePage.tsx": "Renders the Terms of Service page with sections on eligibility, user accounts, acceptable use, content ownership, simulated features, updates, and liability limitations.",
  "frontend/src/pages/TokenomicsPage.tsx": "Presents a conceptual tokenomics framework with prominent disclaimers that QMY is not a financial product, no tokens are issued, and all content is educational only for MiCA/GDPR compliance.",
  "frontend/src/pages/TreasuryMonetaryPolicyPage.tsx": "Displays conceptual treasury and monetary policy models with draft status badges and disclaimers that no real financial execution or token operations exist.",
  "frontend/src/pages/Tutorial.tsx": "Empty file with no content.",
  "frontend/src/pages/VestingDeflationPage.tsx": "Shows vesting schedule and deflation mechanics with visual charts, supporting both Portuguese and English languages via the LanguageContext.",
  "frontend/src/pages/VestingQTM.tsx": "Empty file with no content.",
  "frontend/src/pages/WalletPage.tsx": "Authenticated wallet dashboard displaying QMY and ICP balances, vesting breakdown, transaction history, and simulated send functionality with read-only banners and Internet Identity integration.",
  "frontend/src/utils/bigint.ts": "Empty file with no content.",
  "frontend/src/utils/distance.ts": "Empty file with no content.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/src/VALIDATION_REQUIRED.md": "Documentation of institutional-safe foundation build with read-only wallet, draft Gold Paper, disabled DAO, Internet Identity login, and MiCA/GDPR compliance notes requiring validation before further changes.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a luxury-themed design system with custom colors (gold, amber, quantum-violet), typography (Playfair Display, Inter), shadows, and animations.",
  "project_state.json": "Project metadata tracking the Quantumoney.app website with a profile page that syncs player data (XP, coins, monsters) from QuantumoneyAR.app game canisters, featuring dynamic backgrounds and yellow-themed styling.",
  "public/.well-known/apple-app-site-association": "Empty file for Apple universal links configuration.",
  "public/.well-known/assetlinks.json": "Empty file for Android app links configuration.",
  "scripts/build-mobile.sh": "Empty shell script placeholder for mobile build process.",
  "scripts/test-mobile.sh": "Empty shell script placeholder for mobile testing process."
}