{
  "kind": "build_request",
  "title": "Controlled clean initialization: add minimal IC project files and stop for validation",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Create a minimal root-level package.json that is sufficient to install and build the existing React+TypeScript frontend without regenerating or rewriting any existing application source files.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Create a minimal valid project structure only:\n- package.json"
        ]
      },
      "acceptanceCriteria": [
        "A root-level package.json exists.",
        "package.json contains scripts needed to install dependencies and build the frontend (e.g., dev/build/preview or equivalent).",
        "No existing frontend source files are rewritten as part of creating package.json."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Create a minimal root-level dfx.json defining canisters for the existing backend and frontend assets, without changing any backend code and without attempting deployment.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Create a minimal valid project structure only:\n- dfx.json",
          "- no backend changes",
          "Do not attempt deployment yet."
        ]
      },
      "acceptanceCriteria": [
        "A root-level dfx.json exists.",
        "dfx.json references the existing backend canister entrypoint at backend/main.mo (no edits to backend/main.mo).",
        "dfx.json includes an assets canister that serves the existing frontend build output.",
        "No dfx deploy (or equivalent deployment attempt) is performed as part of this work."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure the frontend entry files exist and are valid: frontend/index.html and frontend/src/main.tsx. If they already exist, do not modify them; only create them if missing.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Create a minimal valid project structure only:\n- frontend entry (index.html + main file)",
          "Do not generate full application code."
        ]
      },
      "acceptanceCriteria": [
        "frontend/index.html exists.",
        "frontend/src/main.tsx exists.",
        "If either file already existed in the workspace prior to this change, its contents remain unchanged (no reformatting or rewriting)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "After creating only the minimal structure files (package.json, dfx.json, and ensuring the frontend entry files exist), STOP and provide an explicit confirmation that these files physically exist in the workspace before any build attempt or further changes.",
      "target": "unknown",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "After creating the structure, STOP and confirm file existence before any build attempt."
        ]
      },
      "acceptanceCriteria": [
        "Work concludes with a confirmation step listing the presence of: package.json, dfx.json, frontend/index.html, and frontend/src/main.tsx.",
        "No build, bundling, or deployment steps are initiated after the confirmation."
      ]
    }
  ],
  "constraints": [
    "Do not redesign UI.",
    "Do not add new features.",
    "Do not change backend logic or files (including backend/main.mo).",
    "Do not regenerate the full application codebase.",
    "Do not attempt deployment yet.",
    "Do not attempt a build yet; stop after confirming required files exist."
  ],
  "nonGoals": [
    "Fixing the original deployment failure (requires logs / later step).",
    "Adding or modifying routes, pages, or components beyond ensuring the entry files exist.",
    "Changing dependencies beyond what is strictly required for a minimal valid workspace foundation."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}