{
  "kind": "build_request",
  "title": "Stage 1+2: Transparent yellow HUD/windows + simulated image-based map with shared internal state",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement Stage 1 visual patch across the main app UI: make all in-app window/panel surfaces fully transparent with thin yellow borders and yellow text, without changing any existing page structure, routes, or feature behavior.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-latest"
        ],
        "quotes": [
          "iniciar build das Etapas 1 e 2"
        ]
      },
      "acceptanceCriteria": [
        "All non-footer window/panel containers render with fully transparent backgrounds (no tinted fill), thin yellow border, and yellow text.",
        "Existing layouts (grid/stacking) remain unchanged; only styling is adjusted.",
        "No existing interactive behavior is removed or altered (auth gating, navigation, buttons, modals continue to work)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Preserve the existing footer exactly as-is (structure, styling, text content, links) and ensure no new 'Caffeine' references are introduced anywhere in the UI as part of Stages 1–2 changes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-latest"
        ],
        "quotes": [
          "Nada do que já está construído será alterado.",
          "Rodapé\nNão alterar nada que já exista.\nRemover qualquer referência a Caffeine, sem mudanças adicionais."
        ]
      },
      "acceptanceCriteria": [
        "frontend/src/components/Footer.tsx is unchanged in rendered output (no visual/style/text/link changes).",
        "No new UI text includes the word 'Caffeine'."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Make Stage 1 mobile-safe: adjust in-app window/panel spacing and HUD placement so that HUD/XP/coins/monsters are not obscured or clipped on small screens, including safe-area insets, while keeping the same information and components.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-latest"
        ],
        "quotes": [
          "Garantir que nada já funcional seja alterado.\nAjustar para visualização em dispositivos móveis."
        ]
      },
      "acceptanceCriteria": [
        "On narrow viewports, HUD content remains fully visible without overlapping primary controls/content in Map Mode and AR Mode.",
        "Safe-area padding utilities are applied where needed so content is not hidden behind notches/home indicators.",
        "No routes/components are removed; only responsive spacing/positioning is adjusted."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Implement Stage 2 simulated map page behavior using an image-based map with internal-coordinate markers for QMY coins and monsters, with no Leaflet/OpenStreetMap dependency and no external geolocation or external map/network calls.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-latest"
        ],
        "quotes": [
          "Nova página com mapa baseado em imagem (substituindo Leaflet/OpenStreetMap real).\nMarcadores de moedas e monstros posicionados conforme coordenadas internas."
        ]
      },
      "acceptanceCriteria": [
        "The map renders as a static image background with an overlay of coin and monster markers.",
        "Marker positions are computed from internal (simulated) coordinates and are deterministic (no external APIs).",
        "No Leaflet/OpenStreetMap scripts/libraries are used for this page."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Simulate internal synchronization between the website map and the AR mode map by sharing the same internal marker/state source so actions/state changes in one view are reflected in the other (within the same user session), without introducing real-time networking.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-latest"
        ],
        "quotes": [
          "Sincronização interna simulada entre site e app AR, compartilhando o mesmo estado."
        ]
      },
      "acceptanceCriteria": [
        "Map Mode and AR Mode consume the same shared internal marker/state source (single source of truth in the frontend).",
        "A state change made in one view (e.g., selecting a marker if selection is implemented) is reflected when switching to the other view in the same session.",
        "No WebSockets or external sync services are added."
      ]
    }
  ],
  "constraints": [
    "Do not modify any paths listed as immutable in SYSTEM_CONTEXT (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui/*).",
    "Backend must remain a single Motoko actor (no additional backend services).",
    "Do not change or remove any existing functionality or routes outside the Stage 1–2 scope.",
    "Do not alter the footer (visual or content).",
    "Do not add Leaflet/OpenStreetMap or any external geolocation/map services.",
    "No new references to 'Caffeine' may be added anywhere."
  ],
  "nonGoals": [
    "Do not implement Stage 3 (Central Bank/DAO/Profile expansions beyond what already exists).",
    "Do not add real NNS wallet integration or real ICP/QMY on-chain transactions beyond existing simulated/read-only behavior.",
    "Do not implement real cross-device sync, push notifications, or real-time communication."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}