{
  "kind": "build_request",
  "title": "Apply institutional Gold Paper expansions as content-only additions (no canister/backend changes)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Integrate the confirmed Gold Paper expansion text as new, additive institutional sections in the existing institutional website content without removing, renaming, or overwriting any existing sections. The added sections must remain strictly conceptual/non-operational, MiCA/GDPR-aligned, and explicitly separated from the AR game.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "CONFIRMED: APPLY CONTENT\n\nPlease apply the proposed Gold Paper expansions as CONTENT ONLY.\n\nDo not remove or overwrite existing sections — integrate this as an institutional expansion and refinement.\n\nNo code changes.\nNo canister changes.\nNo rebuilds.\nNo deployments.\n\nKeep everything strictly conceptual, non-operational, and fully separate from the game."
        ]
      },
      "acceptanceCriteria": [
        "Existing institutional pages retain all current headings/sections and their original text (no deletions/overwrites).",
        "New content is added as clearly labeled expansion/refinement sections (e.g., 'Institutional Expansion' / 'Conceptual Appendix') rather than replacing current content.",
        "All new sections include explicit non-operational language (no promises, no operational instructions, no calls to action to invest) and include MiCA/GDPR-aligned disclaimers.",
        "No gameplay/game-reward mechanics are introduced into these institutional expansions."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add the following conceptual, bank-style explanatory content blocks (as text + simple visual structure like tables/diagrams rendered in the page markup) to the institutional content pages where they fit best (e.g., Treasury/Monetary Policy, Tokenomics, DAO/Governance, Legal), ensuring the content is purely descriptive and does not introduce operational behavior: (1) conceptual token distribution framework, (2) locked vs unlocked balances explanation, (3) vesting & unlock timelines description (illustrative only), (4) theoretical treasury flow model (inbound/outbound, inactive).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "1) Expand the Gold Paper with more detailed, bank-style explanations:\n   - token distribution (conceptual)\n   - locked vs unlocked balances\n   - vesting and unlock timelines (descriptive only)\n   - treasury flows (theoretical)\n\n2) Improve the website pages visually and structurally:\n   - Professional, institutional tone\n   - Black/gold premium design\n   - Tables and diagrams as visual explanations only"
        ]
      },
      "acceptanceCriteria": [
        "Token distribution expansion is descriptive and does not introduce new numeric commitments or operational issuance details beyond what already exists on the site; any added structure is clearly marked conceptual/illustrative.",
        "Locked vs unlocked section clearly states restrictions are conceptual and not currently executed by the system.",
        "Vesting/unlock content is presented as illustrative models (e.g., linear/cliff/multi-stage/regulatory stop-gates) and explicitly states no real schedule is active.",
        "Treasury flows are shown as theoretical inbound/outbound categories and explicitly state they are inactive/non-operational.",
        "Any tables/diagrams added are static, informational UI elements only (no interactive financial tooling)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Maintain the existing premium black/gold institutional presentation while improving the structural readability of the affected institutional pages using content-only layout refinements (e.g., clearer headings, chapter numbering, callout disclaimers, simple tables). Do not introduce new routes, new canisters, backend endpoints, or any gameplay cross-linking within the new content.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Improve the website pages visually and structurally:\n   - Professional, institutional tone\n   - Black/gold premium design\n   - Tables and diagrams as visual explanations only\n\n3) Everything must remain:\n   - Conceptual\n   - Non-operational\n   - Compliant with MiCA and GDPR\n   - Completely separate from the game"
        ]
      },
      "acceptanceCriteria": [
        "Pages keep the existing black/gold theme and institutional tone; changes are limited to content presentation (headings, spacing, callouts, tables).",
        "No new navigation routes are added and no existing routes are removed.",
        "No new links or sections are added that connect these institutional expansions to game mechanics or gameplay pages.",
        "No backend calls, React Query changes, or authentication/actor usage changes are introduced as part of these content updates."
      ]
    }
  ],
  "constraints": [
    "Do not change backend canister code (Motoko) or add any backend endpoints.",
    "Do not perform canister changes, migrations, rebuilds, deployments, or regeneration steps as part of this request.",
    "Content must remain strictly conceptual/non-operational and explicitly separate from the game.",
    "Do not remove or overwrite existing institutional sections; only add integrated expansions/refinements."
  ],
  "nonGoals": [
    "Implementing real token issuance, transfers, vesting, treasury execution, swaps, bridges, or any on-chain financial operations.",
    "Changing Internet Identity authentication, roles, or any gameplay systems/mechanics.",
    "Reworking the documentation canister itself (e.g., whu4t-kiaaa-aaaah-qsc5q-cai) beyond referencing it as an external documentation host."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}