{
  "kind": "build_request",
  "title": "Safe scoped UI patch: QMY Token page background + glass yellow styling + QTM→QMY coin update",
  "projectName": "Quantumoney",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the QMY Token page coin image reference to use a QMY coin asset (replace the current QTM coin image) and ensure all visible token naming on that page reflects “QMY” (not “QTM”).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "Imagem e nome da criptomoeda: substituir “QTM” por “QMY”."
        ]
      },
      "acceptanceCriteria": [
        "On /qmy-token, the coin image is no longer sourced from /assets/generated/qtm-coin-gold-3d-transparent.dim_128x128.png.",
        "Any visible token name on the QMY Token page shows “QMY” (and does not show “QTM”)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Remove the QMY Token page’s black static background so the global dynamic background effect (the same effect used on other pages) is visible behind the page content.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "Fundo dinâmico: mesmo efeito que as outras páginas do site, não mais fundo preto."
        ]
      },
      "acceptanceCriteria": [
        "The QMY Token page no longer sets a solid black page background that obscures the global background scene.",
        "The QMY Token page visually shows the same dynamic background effect as other routed pages that rely on the global layout background."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Restyle all content “windows” (cards/sections) on the QMY Token page to be transparent/glass with very thin yellow borders and yellow typography, while keeping the page layout and content structure otherwise unchanged.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "Janelas: transparentes, com bordas finas amarelas e textos em amarelo."
        ]
      },
      "acceptanceCriteria": [
        "All Card-based sections on /qmy-token are visually transparent/glass (no opaque black fills).",
        "Card borders are thin and yellow across the page.",
        "Primary text within the card windows is yellow (including headings/titles)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Keep the site footer component and its content intact and ensure no Caffeine references are added or reintroduced while applying this patch.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "Rodapé: permanece intacto, sem referências a Caffeine."
        ]
      },
      "acceptanceCriteria": [
        "frontend/src/components/Footer.tsx is not modified by this patch.",
        "No new “Caffeine” references appear anywhere in the UI after the patch."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Do not modify any other page routes, modules, or functionality outside the QMY Token page patch scope.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "Nenhuma outra página ou funcionalidade será alterada."
        ]
      },
      "acceptanceCriteria": [
        "Only the QMY Token page (and its direct static asset needs for the coin image) changes; all other pages behave and render as before."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Resolve the build-blocking configuration error so the project can successfully rebuild and publish with this patch applied.",
      "target": "unknown",
      "source": {
        "messageIds": [
          "msg-12",
          "msg-13"
        ],
        "quotes": [
          "⚠️ Configuration error encountered. Please reach out to the Caffeine team.",
          "Sim"
        ]
      },
      "acceptanceCriteria": [
        "A rebuild completes without configuration errors.",
        "The published app includes the QMY Token page patch and loads successfully."
      ]
    }
  ],
  "constraints": [
    "Frontend files under frontend/src/components/ui are read-only and must not be edited; compose them instead.",
    "Do not edit immutable frontend paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Backend must remain single-actor (backend/main.mo); do not introduce additional canisters/services.",
    "No external databases, third-party auth providers, WebSockets, or external APIs."
  ],
  "nonGoals": [
    "Changing footer layout/content or redesigning the global layout/background system.",
    "Implementing new token functionality (swaps, ledger operations) beyond the existing UI copy.",
    "Refactoring unrelated pages, routes, or shared components."
  ],
  "imageRequirements": {
    "required": [
      "Gold 3D coin with “QMY” mark on a transparent background (qmy-coin-gold-3d-transparent.dim_128x128.png)"
    ],
    "edits": []
  }
}