{
  "kind": "build_request",
  "title": "Quantumoney.app simulated/pro patch: fix LanguageProvider error and enforce simulated UI rules (footer, chat, presale, gold paper, AR-style HUD)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the runtime error \"useLanguage must be used within a LanguageProvider\" by ensuring the entire routed application tree is wrapped in LanguageProvider (without editing any immutable entry files).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "PATCH FINAL – QUANTUMONEY.APP (VERSÃO SIMULADA COMPLETA)\nObjetivo: Corrigir erro useLanguage must be used within a LanguageProvider",
          "Sim — confirmei que você deve iniciar o build agora mesmo, em modo simulado/pro, aplicando todas as instruções que discutimos"
        ]
      },
      "acceptanceCriteria": [
        "Navigating to any route that uses useLanguage() no longer throws the LanguageProvider runtime error.",
        "No changes are made to immutable paths (including frontend/src/main.tsx).",
        "LanguageProvider wrapping does not remove or break any existing pages, routes, or UI content."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Enforce simulated/public chat behavior as UI-only with no backend calls and no persistence: messages must not be stored in localStorage/IndexedDB; they should exist only for the current browser session/tab in memory.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Chat público – SIM, totalmente estático/simulado, sem backend, sem armazenamento de mensagens, apenas visual no navegador.",
          "Sim — confirmei que você deve iniciar o build agora mesmo, em modo simulado/pro... chat público simulado"
        ]
      },
      "acceptanceCriteria": [
        "Reloading the page clears the chat messages (no persisted history).",
        "Public chat continues to function visually (send button, message list updates) without any backend actor calls.",
        "Any explanatory text in the chat UI accurately states that messages are session-only and not synchronized."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure the global layout matches the agreed simulated/pro build requirements: responsive full-height layout using 100dvh semantics, premium black/gold styling, and consistent HUD/map-info-window visual language aligned to QuantumoneyAR.app (visual sync only; no external connections).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Layout global responsivo 100dvh.",
          "HUD, janela de info no mapa AR e sincronização visual com QuantumoneyAR.app.",
          "Sincronização visual com QuantumoneyAR.app – SIM, apenas estética... Sem conexão real com apps externos."
        ]
      },
      "acceptanceCriteria": [
        "The app shell uses a 100dvh-aware min height so pages consistently fill the viewport on mobile (including browser UI variations).",
        "No code introduces any real integration/connection to QuantumoneyAR.app; alignment is strictly visual (layout/colors/HUD/windows/footer).",
        "Existing premium black/gold look-and-feel remains consistent across core pages (no unintended theme regressions)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Update/verify the footer to be visible and usable on all common resolutions and remove any remaining \"Caffeine\" references across the entire site (UI text, footer, metadata, comments, and any other surfaced strings), while preserving all existing content already present.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Rodapé visível em todas as resoluções...",
          "Remoção completa de Caffeine de todo o site e rodapés.",
          "...mantendo todos os conteúdos já existentes."
        ]
      },
      "acceptanceCriteria": [
        "Footer remains readable and links are clickable on mobile and desktop breakpoints.",
        "Footer includes: \"by HTgamers\", support email helpdesk@quantumoney.net, and the phrase \"On-chain na Internet Computer (ICP)\".",
        "A project-wide check finds no visible references to \"Caffeine\" in any rendered page, footer, header, or HTML metadata."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Ensure Terms of Service and Privacy Policy pages are fully populated with the complete Feb/2026 text content (no placeholders/truncation) and remain fully navigable via site links; keep the cookie consent banner visible on entry with working links to the Privacy Policy.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Termos de Serviço e Política de Privacidade completos (fev/2026), totalmente clicáveis.",
          "Termos de Serviço e Política de Privacidade – PRECISO QUE VOCÊ INSIRA os textos completos (versão fev/2026).",
          "Mensagem de cookies ao entrar na página, visível e clicável."
        ]
      },
      "acceptanceCriteria": [
        "/terms and /privacy routes render complete readable documents with headings/lists intact and no truncated sections.",
        "Footer (and any other existing navigation locations) successfully links to /terms and /privacy.",
        "Cookie consent banner appears on first entry (when consent not yet given) and its links to /privacy work."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Keep presale and gold paper features strictly simulated/static UI: do not add real purchase logic, transactions, or backend-changing behavior; preserve all existing presale/gold-paper content and visuals already implemented.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Pré-venda & papel dourado apenas UI estática simulada, sem lógica real de compra.",
          "Todas as funcionalidades simuladas... sem backend real, sem transações reais, apenas UI.",
          "...mantendo todos os conteúdos já existentes."
        ]
      },
      "acceptanceCriteria": [
        "No new backend methods are added or called to process purchases/transactions for presale or gold paper.",
        "Presale and gold paper screens remain accessible and visually intact, behaving as static/simulated UI.",
        "No UI element implies a completed real-world purchase or triggers real ledger/Stripe flows as part of the presale simulation."
      ]
    }
  ],
  "constraints": [
    "Do not edit files listed as immutable, including frontend/src/main.tsx and anything under frontend/src/components/ui.",
    "Respect the single-actor backend architecture; avoid backend schema/state changes unless strictly necessary.",
    "Do not introduce any real-time communication, external app connections, or real purchase/transaction flows; this build is simulated/pro UI-first."
  ],
  "nonGoals": [
    "Implementing real multi-user public chat synchronization or any server-side chat persistence.",
    "Adding real presale purchase processing, payment handling, or on-chain transactions as part of presale/gold paper.",
    "Integrating with QuantumoneyAR.app via APIs/deep links beyond visual/aesthetic alignment."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}