{
  "kind": "build_request",
  "title": "Replace Gold Paper canister link with internal placeholder page (frontend-only)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-4",
      "text": "Update the Gold Paper navigation entry in the header so it no longer links (or redirects) to the canister URL `https://whu4t-kiaaa-aaaah-qsc5q-cai.icp0.io/` and instead routes internally to an on-site page (use the existing route `/gold-paper`). The Gold Paper nav item must be an internal SPA link (no `target=\"_blank\"`, no external `<a href>` to the canister, no JavaScript redirect).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-latest"
        ],
        "quotes": [
          "Remove any link or redirect from the Gold Paper button to the canister URL.",
          "Replace the Gold Paper button with an internal site page (for example /gold-paper or /gold-paper-placeholder).",
          "This is a frontend-only href replacement to eliminate the 503 error."
        ]
      },
      "acceptanceCriteria": [
        "From the header (desktop and mobile), clicking “Gold Paper” navigates to `/gold-paper` within the app (no navigation to `https://whu4t-kiaaa-aaaah-qsc5q-cai.icp0.io/`).",
        "The header Gold Paper item is treated as internal navigation (no external-link icon required, no new tab behavior).",
        "No other header navigation items change behavior or styling."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Replace the current `/gold-paper` page behavior so it does not perform any automatic redirect and does not expose or attempt to fetch any Gold Paper content. The `/gold-paper` page must display ONLY the following single line of text (English, exactly as provided): “Golden Paper temporarily unavailable – content preserved”.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-latest"
        ],
        "quotes": [
          "That page should display only:\n  “Golden Paper temporarily unavailable – content preserved”.",
          "No rebuilds, no migrations, no backend changes."
        ]
      },
      "acceptanceCriteria": [
        "Visiting `/gold-paper` never triggers `window.location.href` changes, timed redirects, or any link to the canister URL.",
        "The page renders only the exact text: “Golden Paper temporarily unavailable – content preserved”.",
        "No additional explanatory text, buttons, canister URLs, spinners, or other UI elements are shown on `/gold-paper`."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Remove (or leave unused) any Gold Paper button/link implementation that routes users to the documentation canister root from the Gold Paper entry point(s), ensuring the frontend no longer causes IC0503/503 errors via the Gold Paper button.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-latest"
        ],
        "quotes": [
          "The issue is only the frontend link.",
          "Remove any link or redirect from the Gold Paper button to the canister URL."
        ]
      },
      "acceptanceCriteria": [
        "There is no remaining user path from the “Gold Paper” button in the header that can navigate to `https://whu4t-kiaaa-aaaah-qsc5q-cai.icp0.io/`.",
        "Clicking “Gold Paper” does not produce a 503 error because it does not attempt to load the non-public canister URL."
      ]
    }
  ],
  "constraints": [
    "Frontend-only change: do not modify backend code (Motoko) or add backend endpoints.",
    "Do not touch any canisters (including `whu4t-kiaaa-aaaah-qsc5q-cai`).",
    "No migrations.",
    "Do not change or rewrite any existing Gold Paper content; preserve it by not exposing it (placeholder-only).",
    "Keep all existing site pages, layout, and styling intact aside from the Gold Paper link/placeholder behavior."
  ],
  "nonGoals": [
    "Making the documentation canister public or changing its asset configuration.",
    "Discovering or validating internal public asset paths inside the documentation canister.",
    "Publishing or reintroducing the full Gold Paper content at this time.",
    "Any rebuild/redeploy workflow changes or infrastructure changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "Use English for any user-facing text in the build request."
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}