{
  "kind": "build_request",
  "title": "Frontend-only full visual redesign and layout rebalancing across key pages",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement a consistent global layout system that prevents content from appearing too high under the fixed header, by introducing a uniform top offset for page content and consistent vertical rhythm (spacing) across the site, without changing navigation, content, or functionality.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Please proceed with the layout‑adjustment phase immediately... to ensure the interface is professional, visually balanced, and consistent across the entire site."
        ]
      },
      "acceptanceCriteria": [
        "All routed pages render their first meaningful content below the fixed header (no overlap).",
        "A single, consistent approach is used site-wide (e.g., a shared page wrapper / page shell) rather than ad-hoc per-page fixes.",
        "No text content, routes, or functional behavior changes (authentication flow, wallet read-only labels, links) are introduced as part of this change."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Perform a full visual redesign (spacing, alignment, typography, component layout) for the critical pages: Home, Login entry points (header login button + any auth-required screens), AR page(s), Map page(s), Profile page(s), and Rules page(s), ensuring a cohesive and professional presentation while preserving existing content and interactions.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "I confirm Option 2: a full visual redesign across all pages, including spacing, alignment, typography, and component layout.",
          "prioritizing critical pages such as Home, Login, AR, Map, Profile, and Rules"
        ]
      },
      "acceptanceCriteria": [
        "Home page layout is visually balanced on mobile and desktop: consistent padding, aligned center content, and no elements clipped by the viewport or header.",
        "Login entry points are visually consistent: the Header login button styling matches the new system, and auth-required screens (e.g., Wallet/Swap unauthenticated states) match the same typography/spacing rules.",
        "If AR/Map/Profile/Rules pages exist in the codebase (including placeholder pages), they use the same redesigned page shell, typography scale, and spacing system as Home/Wallet/Swap.",
        "No backend calls, React Query behavior, or identity logic is changed."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Unify typography, spacing tokens, and component composition across pages by standardizing headings, body text, max-width containers, and card/badge/button layout rules to eliminate inconsistent margins/paddings and improve readability.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "full visual redesign across all pages, including spacing, alignment, typography, and component layout"
        ]
      },
      "acceptanceCriteria": [
        "Heading hierarchy is consistent across pages (e.g., H1/H2 sizing and font usage) and does not vary arbitrarily between Home, Wallet, Swap, Landing, Docs/Legal pages.",
        "All primary page sections use consistent max-width and horizontal padding conventions (e.g., container usage) for mobile/tablet/desktop.",
        "Buttons, cards, and banners (including the 'Read-Only – Transfers Disabled' banners) maintain their wording but have consistent spacing, alignment, and responsive behavior.",
        "No Shadcn UI component source files under frontend/src/components/ui are modified (compose instead)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Apply a single cohesive visual theme (colors, typography, layout style) across all pages and components to make the UI feel deliberate and consistent. Keep the existing dark + gold direction but refine it into a polished, editorial 'dark-luxury' system with consistent surfaces, borders, and hover/focus states.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "ensure the interface is professional, visually balanced, and consistent across the entire site"
        ]
      },
      "acceptanceCriteria": [
        "The site uses a consistent set of surface styles (backgrounds, glass cards, borders) and interaction states (hover/focus/disabled) across Header, Footer, and main page content.",
        "No new product features are introduced; only visual/presentation improvements are made.",
        "Theme changes do not reduce accessibility (text contrast remains readable on dark backgrounds)."
      ]
    }
  ],
  "constraints": [
    "Frontend-only changes: no canister changes, no backend modifications, no token minting, no transfers, no simulations.",
    "Maintain all current content, navigation, and functionality (presentation changes only).",
    "Do not edit immutable frontend paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, and any sources under frontend/src/components/ui."
  ],
  "nonGoals": [
    "Adding new backend endpoints or changing Motoko state/schema.",
    "Implementing new AR/Map/game functionality beyond visual/layout work.",
    "Changing routing structure or adding new navigation items not already present.",
    "Replacing existing generated images/logos (unless explicitly requested later)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}