{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Replace Gold Paper external canister link with internal placeholder page",
  "requirements": [
    {
      "id": "REQ-4",
      "summary": "Change the header “Gold Paper” navigation item (desktop + mobile) to use internal SPA navigation to /gold-paper, with no external URL behavior.",
      "acceptanceCriteria": [
        "From the header (desktop and mobile), clicking “Gold Paper” navigates to `/gold-paper` within the app (no navigation to `https://whu4t-kiaaa-aaaah-qsc5q-cai.icp0.io/`).",
        "The header Gold Paper item is treated as internal navigation (no external-link icon required, no new tab behavior).",
        "No other header navigation items change behavior or styling."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Replace the current external Gold Paper nav item (which uses the docs canister URL + ExternalLink icon + target=_blank) with an internal TanStack Router <Link> pointing to `/gold-paper` for both desktop and mobile menus; remove the docs canister constants from this header file while keeping all other nav items unchanged."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Replace /gold-paper page content with a single-line English placeholder message and remove any redirect or content fetching attempts.",
      "acceptanceCriteria": [
        "Visiting `/gold-paper` never triggers `window.location.href` changes, timed redirects, or any link to the canister URL.",
        "The page renders only the exact text: “Golden Paper temporarily unavailable – content preserved”.",
        "No additional explanatory text, buttons, canister URLs, spinners, or other UI elements are shown on `/gold-paper`."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/GoldPaper.tsx",
          "operation": "modify",
          "description": "Remove the auto-redirect useEffect, the manual redirect button, any references/constants for the documentation canister URL, and any multilingual/extra UI; ensure the component renders ONLY the exact single line text: “Golden Paper temporarily unavailable – content preserved”."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Eliminate any remaining Gold Paper entry-point code paths that navigate to the documentation canister root, preventing 503/IC0503 errors triggered by the Gold Paper button.",
      "acceptanceCriteria": [
        "There is no remaining user path from the “Gold Paper” button in the header that can navigate to `https://whu4t-kiaaa-aaaah-qsc5q-cai.icp0.io/`.",
        "Clicking “Gold Paper” does not produce a 503 error because it does not attempt to load the non-public canister URL."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Audit and remove any remaining external-anchor/new-tab behavior or canister URL usage associated with the “Gold Paper” header entry point, ensuring the only action is internal navigation to `/gold-paper`."
        },
        {
          "path": "frontend/src/pages/GoldPaper.tsx",
          "operation": "modify",
          "description": "Ensure there are zero remaining canister URL references and zero redirect mechanisms (including window.location assignments and timers) within the `/gold-paper` page implementation."
        }
      ]
    }
  ]
}