{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Quantumoney.app simulated/pro patch: LanguageProvider fix + simulated UI rules enforcement",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Wrap the entire routed app tree in LanguageProvider to eliminate useLanguage runtime errors without modifying immutable entry files.",
      "acceptanceCriteria": [
        "Navigating to any route that uses useLanguage() no longer throws the LanguageProvider runtime error.",
        "No changes are made to immutable paths (including frontend/src/main.tsx).",
        "LanguageProvider wrapping does not remove or break any existing pages, routes, or UI content."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wrap the RouterProvider (and thus the routed application tree) with LanguageProvider so any route/component using useLanguage() has context, while preserving existing providers and routes. Do not touch immutable entry files."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Make Public Chat strictly simulated UI-only with in-memory, per-tab session messages and no backend calls or persistence.",
      "acceptanceCriteria": [
        "Reloading the page clears the chat messages (no persisted history).",
        "Public chat continues to function visually (send button, message list updates) without any backend actor calls.",
        "Any explanatory text in the chat UI accurately states that messages are session-only and not synchronized."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/usePublicChat.ts",
          "operation": "modify",
          "description": "Remove any localStorage/IndexedDB persistence and ensure messages live only in runtime memory for the current tab/session; keep the same hook API used by the page and ensure no backend calls are introduced."
        },
        {
          "path": "frontend/src/pages/PublicChatPage.tsx",
          "operation": "modify",
          "description": "Update the chat disclaimer copy to explicitly state session-only/in-memory behavior (no persistence and no synchronization) and verify UI behavior remains fully functional (send button, list updates) without backend actor usage."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Align global shell with simulated/pro layout rules: 100dvh full-height semantics, premium black/gold styling consistency, and AR-style HUD/map info-window visual language (visual sync only).",
      "acceptanceCriteria": [
        "The app shell uses a 100dvh-aware min height so pages consistently fill the viewport on mobile (including browser UI variations).",
        "No code introduces any real integration/connection to QuantumoneyAR.app; alignment is strictly visual (layout/colors/HUD/windows/footer).",
        "Existing premium black/gold look-and-feel remains consistent across core pages (no unintended theme regressions)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "Update the app shell container to use 100dvh-aware full-height behavior (e.g., min height using 100dvh semantics) and ensure header/main/footer structure remains intact and responsive; keep changes purely visual (no external app connections)."
        },
        {
          "path": "frontend/src/components/PageShell.tsx",
          "operation": "modify",
          "description": "Replace min-h-screen usage with a 100dvh-aware min height so all pages consistently fill the viewport on mobile while preserving existing top padding and optional className behavior."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add/adjust global utilities/tokens needed for 100dvh-aware layout and define consistent premium black/gold HUD + map info-window visual utility classes to match the QuantumoneyAR.app visual language (visual-only alignment; no integrations)."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Ensure footer is always visible/usable across resolutions and remove any remaining visible 'Caffeine' references site-wide while preserving existing content.",
      "acceptanceCriteria": [
        "Footer remains readable and links are clickable on mobile and desktop breakpoints.",
        "Footer includes: \"by HTgamers\", support email helpdesk@quantumoney.net, and the phrase \"On-chain na Internet Computer (ICP)\".",
        "A project-wide check finds no visible references to \"Caffeine\" in any rendered page, footer, header, or HTML metadata."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Adjust footer spacing/typography for small screens, ensure links remain clickable and not obstructed, and confirm required footer strings are present (by HTgamers, helpdesk@quantumoney.net, and 'On-chain na Internet Computer (ICP)') while preserving existing footer content and structure."
        },
        {
          "path": "frontend/src/components/CookieConsentBanner.tsx",
          "operation": "modify",
          "description": "Prevent the fixed cookie banner from blocking footer usability on common resolutions (e.g., by adding safe-area-aware spacing behavior and/or reserving space when visible) while keeping it visible on entry and maintaining existing banner behavior/links."
        },
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Audit and remove any 'Caffeine' references from surfaced metadata (title/description/OpenGraph/Twitter/canonical-related visible strings) if present, without removing any existing non-Caffeine metadata content."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Populate and verify Terms and Privacy pages with complete Feb/2026 content and keep cookie banner visible on entry with working privacy links.",
      "acceptanceCriteria": [
        "/terms and /privacy routes render complete readable documents with headings/lists intact and no truncated sections.",
        "Footer (and any other existing navigation locations) successfully links to /terms and /privacy.",
        "Cookie consent banner appears on first entry (when consent not yet given) and its links to /privacy work."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/TermsOfServicePage.tsx",
          "operation": "modify",
          "description": "Insert/verify the complete Feb/2026 Terms of Service document (no placeholders/truncation) with preserved heading/list formatting and ensure it remains readable and consistent with the premium theme."
        },
        {
          "path": "frontend/src/pages/PrivacyPolicyPage.tsx",
          "operation": "modify",
          "description": "Insert/verify the complete Feb/2026 Privacy Policy document (no placeholders/truncation) with preserved heading/list formatting and ensure it remains readable and consistent with the premium theme."
        },
        {
          "path": "frontend/src/components/CookieConsentBanner.tsx",
          "operation": "modify",
          "description": "Verify the banner appears on first entry when consent is not given and that all links to /privacy navigate correctly; keep the banner visible/usable and consistent with the simulated/pro premium styling."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Keep presale and gold paper strictly simulated/static UI with no real purchase logic and preserve existing visuals/content.",
      "acceptanceCriteria": [
        "No new backend methods are added or called to process purchases/transactions for presale or gold paper.",
        "Presale and gold paper screens remain accessible and visually intact, behaving as static/simulated UI.",
        "No UI element implies a completed real-world purchase or triggers real ledger/Stripe flows as part of the presale simulation."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PresalePage.tsx",
          "operation": "modify",
          "description": "Review and adjust copy/labels to ensure the presale experience is clearly simulated/static (no real purchase implications such as KYC/purchase readiness), and verify no UI elements initiate real payment/ledger flows; preserve existing presale visuals and simulated explorers."
        },
        {
          "path": "frontend/src/pages/GoldPaper.tsx",
          "operation": "modify",
          "description": "Verify Gold Paper remains informational/simulated with no purchase/transaction CTAs and preserve all existing content/visuals while keeping styling consistent with the simulated/pro premium black/gold language."
        }
      ]
    }
  ]
}