{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Controlled clean initialization: minimal IC + React workspace scaffolding (frontend-only)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a minimal root-level package.json to install and build the existing React+TypeScript frontend without touching existing source files.",
      "acceptanceCriteria": [
        "A root-level package.json exists.",
        "package.json contains scripts needed to install dependencies and build the frontend (e.g., dev/build/preview or equivalent).",
        "No existing frontend source files are rewritten as part of creating package.json."
      ],
      "file_operations": [
        {
          "path": "frontend/../package.json",
          "operation": "create",
          "description": "Create a minimal root-level package.json (via this relative path) with only essential scripts (dev/build/preview) and dependencies required by the existing frontend codebase; do not modify any existing frontend source files."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add a minimal root-level dfx.json defining backend and frontend assets canisters, pointing at existing backend/main.mo and serving the existing frontend build output, without deploying.",
      "acceptanceCriteria": [
        "A root-level dfx.json exists.",
        "dfx.json references the existing backend canister entrypoint at backend/main.mo (no edits to backend/main.mo).",
        "dfx.json includes an assets canister that serves the existing frontend build output.",
        "No dfx deploy (or equivalent deployment attempt) is performed as part of this work."
      ],
      "file_operations": [
        {
          "path": "frontend/../dfx.json",
          "operation": "create",
          "description": "Create a minimal root-level dfx.json (via this relative path) that declares a backend canister referencing backend/main.mo and an assets canister serving the frontend build output directory; do not perform any deployment actions."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Ensure frontend entry files exist (index.html and main.tsx) without modifying them if already present.",
      "acceptanceCriteria": [
        "frontend/index.html exists.",
        "frontend/src/main.tsx exists.",
        "If either file already existed in the workspace prior to this change, its contents remain unchanged (no reformatting or rewriting)."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "create",
          "description": "Only if missing: create a valid frontend/index.html with a root mount element and module script loading /src/main.tsx; if the file already exists, do not modify it."
        },
        {
          "path": "frontend/src/main.tsx",
          "operation": "create",
          "description": "Only if missing: create a valid React+TypeScript bootstrap file that mounts the app into #root; if the file already exists, do not modify it."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Stop after creating the minimal structure and add an explicit confirmation step that the required files exist, with no build/deploy initiated afterward.",
      "acceptanceCriteria": [
        "Work concludes with a confirmation step listing the presence of: package.json, dfx.json, frontend/index.html, and frontend/src/main.tsx.",
        "No build, bundling, or deployment steps are initiated after the confirmation."
      ],
      "file_operations": [
        {
          "path": "frontend/STRUCTURE_CONFIRMATION.md",
          "operation": "create",
          "description": "Create a short, explicit confirmation checklist instructing the operator to verify that frontend/../package.json, frontend/../dfx.json, frontend/index.html, and frontend/src/main.tsx physically exist in the workspace, and to STOP before any build/bundle/deploy."
        },
        {
          "path": "frontend/src/VALIDATION_REQUIRED.md",
          "operation": "modify",
          "description": "Append a new 'Controlled clean initialization' validation section that requires explicitly confirming the presence of the four required files and reiterates that no build/bundling/deployment should be attempted after confirmation."
        }
      ]
    }
  ]
}