{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Quantumoney: QMY Token page scoped UI patch (coin asset + background + glass yellow styling) + build config fix",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Replace QTM coin image with QMY coin asset and ensure all visible naming on /qmy-token shows QMY only.",
      "acceptanceCriteria": [
        "On /qmy-token, the coin image is no longer sourced from /assets/generated/qtm-coin-gold-3d-transparent.dim_128x128.png.",
        "Any visible token name on the QMY Token page shows “QMY” (and does not show “QTM”)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/qmy-coin-gold-3d-transparent.dim_128x128.png",
          "operation": "create",
          "description": "Add the required generated QMY coin asset at frontend/public/assets/generated/qmy-coin-gold-3d-transparent.dim_128x128.png (dim_128x128) for use on the QMY Token page."
        },
        {
          "path": "frontend/src/pages/QMYTokenPage.tsx",
          "operation": "modify",
          "description": "Update the hero coin <img> to reference frontend/public/assets/generated/qmy-coin-gold-3d-transparent.dim_128x128.png (and remove the QTM coin reference), and audit/adjust any remaining visible copy on this page to ensure it displays “QMY” only. Use existing shadcn-ui Card composition (do not edit frontend/src/components/ui/*). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Remove the QMY Token page black static background so the global dynamic background scene shows through.",
      "acceptanceCriteria": [
        "The QMY Token page no longer sets a solid black page background that obscures the global background scene.",
        "The QMY Token page visually shows the same dynamic background effect as other routed pages that rely on the global layout background."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/QMYTokenPage.tsx",
          "operation": "modify",
          "description": "Remove/replace the top-level bg-black styling (and any other opaque background styling on the page wrapper) so the Layout’s global background scene remains visible behind the page content while preserving spacing/padding and layout structure."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Restyle all QMY Token page card/section windows to glass/transparent with thin yellow borders and yellow typography without changing layout/content structure.",
      "acceptanceCriteria": [
        "All Card-based sections on /qmy-token are visually transparent/glass (no opaque black fills).",
        "Card borders are thin and yellow across the page.",
        "Primary text within the card windows is yellow (including headings/titles)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add page-scoped utility classes for the /qmy-token glass windows (transparent/glass surface), thin yellow borders, and yellow typography that can be applied without modifying any read-only shadcn-ui components."
        },
        {
          "path": "frontend/src/pages/QMYTokenPage.tsx",
          "operation": "modify",
          "description": "Apply the new /qmy-token glass + thin yellow border + yellow text styling consistently across all Card-based sections and headings, removing black/opaque fills (e.g., bg-black/60) while keeping the existing grid/layout and content structure unchanged. Use existing shadcn-ui Card composition (do not edit frontend/src/components/ui/*). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Preserve the existing footer unchanged and ensure no Caffeine references exist in the UI after the patch.",
      "acceptanceCriteria": [
        "frontend/src/components/Footer.tsx is not modified by this patch.",
        "No new “Caffeine” references appear anywhere in the UI after the patch."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/QMYTokenPage.tsx",
          "operation": "modify",
          "description": "Verify the QMY Token page contains no “Caffeine” text and does not introduce any new references while applying the scoped styling and asset updates (no changes to the footer component)."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Keep the patch strictly scoped to the QMY Token page (and required static coin asset) without altering other routes or features.",
      "acceptanceCriteria": [
        "Only the QMY Token page (and its direct static asset needs for the coin image) changes; all other pages behave and render as before."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/QMYTokenPage.tsx",
          "operation": "modify",
          "description": "Consolidate all UI changes for this patch within the QMY Token page only (and shared CSS utilities if needed), ensuring no route definitions, navigation, or unrelated modules/pages are modified."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Fix the frontend build-blocking configuration issue so the app rebuilds and can be published with the QMY Token page patch.",
      "acceptanceCriteria": [
        "A rebuild completes without configuration errors.",
        "The published app includes the QMY Token page patch and loads successfully."
      ],
      "file_operations": [
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Adjust the Tailwind configuration to a build-compatible module format for the current toolchain (e.g., ensure correct JS module export style and valid config shape) so rebuild/publish completes without configuration errors."
        }
      ]
    }
  ]
}