{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 10,
  "summary": "Quantumoney AR / QMY Luxury Pro is a bilingual (PT/EN) React + TypeScript web portal with a luxury black/gold theme that serves (1) as an institutional/marketing and documentation site (Gold Paper, DAO & Governance, Treasury & Monetary Policy, tokenomics, legal, roadmap, etc.) and (2) as a foundation for an AR/mobile game experience backed by an Internet Computer Motoko canister supporting player registration, XP/energy progression, monster capture, GPS-based coin planting/rescue mechanics, AR spot token claims, and Stripe checkout integration via an external integrations canister. The repo now also includes Capacitor/mobile build & deep-linking setup plus offline/deep-link utilities to support app-style distribution. Governance/treasury pages are explicitly conceptual/non-operational and contain strong MiCA/GDPR disclaimers.",
  "architectural_notes": [
    "Frontend is a SPA built with React + TypeScript, TanStack Router for routing, TailwindCSS for styling, and next-themes for a forced dark theme.",
    "Bilingual UI is implemented via a LanguageContext that persists language selection in localStorage and provides translated nav/footer labels.",
    "Global app shell uses a Layout route component that wraps all pages with Header/Outlet/Footer; Header is responsive with a mobile Sheet menu.",
    "Large long-form documentation is implemented as a single scrollable Gold Paper page with sticky section navigation and active-section tracking via scroll position.",
    "Authentication is provided through Internet Identity (@dfinity/auth-client) in a dedicated provider/hook managing identity persistence and login state.",
    "Backend is a single Motoko canister with in-memory Map-based state for profiles, daily limits, planted coins, and AR spot claims/distributions; access control is a shared module.",
    "Frontend-backend actor lifecycle is managed via a React Query-powered useActor hook that recreates the actor on identity changes and invalidates other queries.",
    "Backend composes features via mixins/includes (StripeMixin and blob-storage Mixin) to expose auxiliary service endpoints from the same canister.",
    "Stripe integration is implemented as a Motoko module maintaining an admin-managed price catalog and delegating API calls to a separate integrations canister with cycles attached.",
    "Capacitor configuration, build/test scripts, and mobile build guides were added to package the SPA for Android/iOS distribution."
  ],
  "known_issues": [
    "Backend state (profiles, planted coins, limits, claims, distributions) is stored in non-stable in-memory Maps; canister upgrades will lose state unless an external migration/stable strategy is added.",
    "Access control bootstrapping assigns the first non-anonymous caller as admin (initializeAccessControl); without an allowlist this can be captured by an unintended principal.",
    "Many backend validation/business-rule failures use Runtime.trap with messages prefixed as \"Unauthorized\", conflating auth errors with user-input/state errors and complicating UX/error handling.",
    "Storage.refillCashier uses Nat.sub(currentBalance, reservedCycles) without guarding currentBalance < reservedCycles, which can trap under low-cycle conditions.",
    "Stripe and other backend functionality hard-depend on environment variables (FRONTEND_URL, INTEGRATIONS_CANISTER_ID, CAFFFEINE_STORAGE_CASHIER_PRINCIPAL); missing/malformed values will trap at runtime.",
    "Monster capture allows duplicates; there is no server-side uniqueness/collection completion enforcement.",
    "AR spot claiming tracks total distributed per spot but does not enforce a maximum cap per spot/supply; distribution totals can grow without bound as long as wallets keep claiming unique keys.",
    "Coin IDs are derived from caller + Time.now(); while likely fine, there’s no explicit collision handling and no indexing by location for efficient spatial queries.",
    "Frontend uses process.env.II_URL for the Internet Identity provider URL; depending on the bundler/environment, this may require explicit env wiring (e.g., Vite import.meta.env) to avoid undefined at runtime.",
    "Several referenced gameplay/mobile/deep-link/offline related modules are indicated by repository summaries but their implementations are not present in the provided file contents; feature coverage for those areas may be incomplete in this analysis."
  ],
  "isFixRequest": false,
  "existing_features": [
    {
      "id": "IF-1",
      "title": "Bilingual language system with persistence",
      "synonyms": [
        "i18n",
        "PT/EN toggle",
        "LanguageContext"
      ],
      "description": "Provides Portuguese/English language selection via React context, persists the selected language in localStorage, and exposes translated navigation/footer labels to components.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Multi-page SPA routing with TanStack Router",
      "synonyms": [
        "routing",
        "TanStack Router"
      ],
      "description": "Defines a root layout route and multiple page routes (landing, home, about, tokenomics, AR distribution, DAO, treasury/monetary policy, roadmap, vesting/deflation, presale, technical, game systems, legal, contact, gold paper) using @tanstack/react-router.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Global layout shell with fixed header and footer",
      "synonyms": [
        "Layout",
        "app chrome"
      ],
      "description": "Wraps routed content with a shared Layout component that provides LanguageProvider, a fixed Header, routed Outlet content, and a Footer across all pages.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "Responsive header navigation with mobile sheet menu",
      "synonyms": [
        "Header",
        "navigation"
      ],
      "description": "Implements a fixed top header with desktop nav buttons, a mobile slide-out (Sheet) menu, and an in-header language toggle that switches PT/EN.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "Footer with branding, contact links, and compliance messaging",
      "synonyms": [
        "Footer",
        "support links"
      ],
      "description": "Renders Quantumoney AR branding, helpdesk email, website link, and GDPR/MiCA compliance text using translated strings from LanguageContext.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "Luxury black/gold design system (Tailwind + CSS variables)",
      "synonyms": [
        "theme",
        "OKLCH palette",
        "glass-card"
      ],
      "description": "Tailwind config and global CSS define a luxury black/gold OKLCH color system, typography (Playfair Display/Inter), glassmorphism utility, custom scrollbar, and fade-in animations; app uses next-themes to force dark mode.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "Landing page marketing funnel with CTA",
      "synonyms": [
        "LandingPage",
        "marketing site"
      ],
      "description": "Marketing landing page with hero section, feature highlight cards, dashboard callout, and footer; primary CTA redirects users to the external app URL (quantumoneyar.app).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "Cinematic Home hero with animated text cycle",
      "synonyms": [
        "HomePage",
        "hero animation"
      ],
      "description": "Homepage hero with animated galaxy background, periodic bilingual text visibility (interval/timers), language toggle button, and install CTA redirecting to quantumoneyar.app.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Informational page suite (static institutional/marketing content)",
      "synonyms": [
        "About",
        "Tokenomics",
        "AR Distribution",
        "Roadmap",
        "Vesting/Deflation",
        "Presale",
        "Technical",
        "Game Systems",
        "Legal",
        "Contact"
      ],
      "description": "Implements multiple bilingual informational pages describing the project vision, token distribution, global AR spot distribution, milestones, vesting/deflation visuals, presale structure, technical architecture, gameplay system overview, legal compliance, and support contacts.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Gold Paper long-form documentation page with sticky section navigation",
      "synonyms": [
        "GoldPaper",
        "whitepaper"
      ],
      "description": "Provides a bilingual long-form documentation page with a hero, sticky nav of 10 sections, smooth scrolling to anchors, active section tracking via scroll listener, and extensive embedded visual assets and tables.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "Treasury & Monetary Policy conceptual documentation page",
      "synonyms": [
        "TreasuryMonetaryPolicyPage",
        "treasury page"
      ],
      "description": "Bilingual institutional page outlining a conceptual (non-operational) treasury, vesting, and deflationary monetary policy model with explicit non-execution disclaimers and compliance notes.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Internet Identity authentication provider/hook",
      "synonyms": [
        "Internet Identity",
        "AuthClient",
        "login/logout"
      ],
      "description": "Implements an InternetIdentityProvider and useInternetIdentity hook using @dfinity/auth-client, handling initialization, identity persistence, login/logout, and granular login status flags.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Authenticated backend actor creation via React Query",
      "synonyms": [
        "useActor",
        "actor lifecycle"
      ],
      "description": "Creates an anonymous or identity-bound canister actor keyed by principal; when authenticated, calls initializeAccessControl and invalidates/refetches non-actor queries upon actor changes.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "Backend role-based access control (admin/user/guest)",
      "synonyms": [
        "RBAC",
        "AccessControl"
      ],
      "description": "Motoko access-control module assigns roles, supports admin role assignment, and provides permission checks; first initialized principal becomes admin, others default to user.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "Player registration with welcome bonus and daily limit initialization",
      "synonyms": [
        "registerPlayer",
        "PlayerProfile"
      ],
      "description": "Backend registration creates a new profile with initial energy=100, availableTokens=100, bonusTokens=900, xp=100, level=1 and initializes daily limits tracking for plants/rescues.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "Player profile read/write endpoints with permission checks",
      "synonyms": [
        "getUserProfile",
        "saveCallerUserProfile"
      ],
      "description": "Backend supports querying the caller’s profile, querying a specific user’s profile (self/admin), saving the caller’s profile, and admin listing of all profiles.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-17",
      "title": "Daily limits tracking with automatic 24h reset",
      "synonyms": [
        "daily limits",
        "resetDailyLimitsIfNeeded"
      ],
      "description": "Backend maintains per-player daily limits for planting and rescuing operations and resets counters when 24 hours have elapsed since last reset.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-18",
      "title": "Monster capture and captured monster inventory",
      "synonyms": [
        "captureMonster",
        "capturedMonsters"
      ],
      "description": "Backend captures monsters by appending a timestamped CapturedMonster record to the player profile and restores energy up to a cap of 100 based on monster energyBoost.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-19",
      "title": "GPS coin planting with limits and XP rewards",
      "synonyms": [
        "plantCoin",
        "plantedCoins"
      ],
      "description": "Backend allows planting a coin at validated coordinates, enforces 3 plants/day and at least 1 available token, stores planted coin records, and updates profile (+10 XP, move 1 token from available to planted).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-20",
      "title": "GPS coin rescue with XP-radius, lock rules, rewards and costs",
      "synonyms": [
        "rescueSingleCoin",
        "XP radius"
      ],
      "description": "Backend rescues a planted coin if within a radius equal to the player’s XP (meters), enforces 100 rescues/day, prevents rescuing own coins until 30 days have elapsed, grants 2 tokens for expired own coins otherwise 1, and charges 15 XP when rescuing others.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-21",
      "title": "AR spot claim system with atomic per-wallet-per-spot enforcement",
      "synonyms": [
        "claimARSpot",
        "AR distribution claim"
      ],
      "description": "Backend enforces each wallet can claim exactly 4000 QTM per spot once using a composite key (spotId:principal), records claims, updates per-spot distribution totals/counts, and credits QTM to player balances; includes distribution query and claim-status query endpoints.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-22",
      "title": "Energy restore endpoint",
      "synonyms": [
        "restoreEnergy"
      ],
      "description": "Backend endpoint restores the caller’s energy to 100 with registration and permission checks.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-23",
      "title": "Admin player reset and player statistics",
      "synonyms": [
        "adminResetPlayer",
        "adminGetPlayerCount"
      ],
      "description": "Admin-only endpoints support resetting a non-admin player’s profile/daily limits and retrieving total registered player count.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-24",
      "title": "Stripe catalog and checkout session creation via integrations canister",
      "synonyms": [
        "Stripe",
        "checkout"
      ],
      "description": "Motoko Stripe module maintains an admin-managed Stripe price catalog and creates checkout sessions by sending candid payloads to an external integrations canister; includes payment success/cancel callback handlers exposed via a mixin.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-25",
      "title": "ICP HTTP outcalls utility (GET/POST) with response transform",
      "synonyms": [
        "http_request",
        "outcall.mo"
      ],
      "description": "Provides Motoko helper functions for IC management canister HTTP GET/POST with a transform function that strips headers and includes a User-Agent plus idempotency key for POST requests.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-26",
      "title": "Blob storage gateway authorization and maintenance endpoints",
      "synonyms": [
        "blob storage",
        "Storage mixin"
      ],
      "description": "Includes a Motoko storage module/mixin that fetches authorized gateway principals from a cashier canister, checks authorization for pruning APIs, supports cycles refill to cashier, and exposes dead-blob listing and deletion confirmation with forced GC trigger.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-27",
      "title": "URL parameter and secret-hash utilities",
      "synonyms": [
        "urlParams",
        "session persistence"
      ],
      "description": "Utility functions to read URL/query/hash parameters, persist them to sessionStorage, extract secrets from hash fragments, and clear sensitive hash params from the URL using history.replaceState.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-28",
      "title": "Camera hook with capture and camera switching",
      "synonyms": [
        "useCamera",
        "getUserMedia"
      ],
      "description": "Provides start/stop camera lifecycle, switch between front/back cameras, capture photos to File via canvas, browser capability checks, and structured error reporting with cleanup on unmount.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-29",
      "title": "QR scanner hook with dynamic jsQR loading",
      "synonyms": [
        "useQRScanner",
        "jsQR"
      ],
      "description": "Dynamically loads jsQR in the browser, scans camera frames on an interval, deduplicates results, maintains a bounded scan history, and exposes start/stop/switch camera controls via the underlying camera hook.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-30",
      "title": "Capacitor mobile build pipeline and guides",
      "synonyms": [
        "Capacitor",
        "mobile build",
        "Android/iOS guides"
      ],
      "description": "Adds Capacitor configuration plus dedicated build/test scripts and documentation (build guides) to package the React SPA as a mobile app, including a reusable build-template and deployment scaffolding.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-31",
      "title": "Deep linking and app association support (Android/iOS)",
      "synonyms": [
        "deep links",
        "AASA",
        "assetlinks"
      ],
      "description": "Implements deep-link handling utilities and provides platform association files (/.well-known/apple-app-site-association and /.well-known/assetlinks.json) with setup documentation to enable opening routes inside the app from external links.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-32",
      "title": "Offline manager utility for app-like resilience",
      "synonyms": [
        "offline mode",
        "connectivity handling"
      ],
      "description": "Introduces an offline manager utility to coordinate offline/online state and support more resilient behavior in mobile/app contexts.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-33",
      "title": "In-app game UI shell (AR/Map modes, bottom navigation, and gameplay modals)",
      "synonyms": [
        "ARMode",
        "MapMode",
        "BottomNav",
        "game UI"
      ],
      "description": "Adds dedicated gameplay-oriented pages and components (AR mode, map mode, profile/collection screens) with bottom navigation and multiple game modals/panels (plant/rescue confirmations, AR spot modal, token/monster detail, energy UI, welcome bonus banners).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-34",
      "title": "shadcn/ui-based component library integrated into build template",
      "synonyms": [
        "shadcn/ui",
        "UI primitives",
        "component template"
      ],
      "description": "Adds a build-template frontend that includes a comprehensive set of shadcn/ui component primitives, eslint rules, and supporting scripts (e.g., image prune/resize) for consistent UI development and reuse.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "feature-integrate-the-confirmed-gold-paper-expansion-text-as-new-additive-institutional-sections-in-the-existing-institutional-website-content-without-removing-renaming-or-overwriting-any-existing-sections-the-added-sections-must-remain-strictly-conceptual-non-operational-mica-gdpr-aligned-and-explicitly-separated-from-the-ar-game",
      "title": "Integrate the confirmed Gold Paper expansion text as new, additive institutional sections in the existing institutional website content without removing, renaming, or overwriting any existing sections. The added sections must remain strictly conceptual/non-operational, MiCA/GDPR-aligned, and explicitly separated from the AR game.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "feature-add-the-following-conceptual-bank-style-explanatory-content-blocks-as-text-simple-visual-structure-like-tables-diagrams-rendered-in-the-page-markup-to-the-institutional-content-pages-where-they-fit-best-e-g-treasury-monetary-policy-tokenomics-dao-governance-legal-ensuring-the-content-is-purely-descriptive-and-does-not-introduce-operational-behavior-1-conceptual-token-distribution-framework-2-locked-vs-unlocked-balances-explanation-3-vesting-unlock-timelines-description-illustrative-only-4-theoretical-treasury-flow-model-inbound-outbound-inactive",
      "title": "Add the following conceptual, bank-style explanatory content blocks (as text + simple visual structure like tables/diagrams rendered in the page markup) to the institutional content pages where they fit best (e.g., Treasury/Monetary Policy, Tokenomics, DAO/Governance, Legal), ensuring the content is purely descriptive and does not introduce operational behavior: (1) conceptual token distribution framework, (2) locked vs unlocked balances explanation, (3) vesting & unlock timelines description (illustrative only), (4) theoretical treasury flow model (inbound/outbound, inactive).",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    },
    {
      "id": "feature-maintain-the-existing-premium-black-gold-institutional-presentation-while-improving-the-structural-readability-of-the-affected-institutional-pages-using-content-only-layout-refinements-e-g-clearer-headings-chapter-numbering-callout-disclaimers-simple-tables-do-not-introduce-new-routes-new-canisters-backend-endpoints-or-any-gameplay-cross-linking-within-the-new-content",
      "title": "Maintain the existing premium black/gold institutional presentation while improving the structural readability of the affected institutional pages using content-only layout refinements (e.g., clearer headings, chapter numbering, callout disclaimers, simple tables). Do not introduce new routes, new canisters, backend endpoints, or any gameplay cross-linking within the new content.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Expand Gold Paper with more detailed institutional/bank-style conceptual explanations (token distribution, locked vs unlocked balances, vesting/unlock timelines, theoretical treasury flows) without removing existing sections; remain MiCA/GDPR-compliant and separate from the game",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Refine institutional website content presentation (professional tone, black/gold premium look-and-feel, add conceptual-only tables/diagrams) as content/structure updates only (no code/canister/deploy changes)",
      "reqIds": [],
      "status": "pending"
    }
  ],
  "gameProjectType": "none",
  "projectName": "Quantumoney AR",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}