{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Initialize a minimal, stable Internet Computer workspace foundation (no full app regeneration) to recover from missing persisted project files and prepare for later deployment stabilization.",
  "architectural_notes": [
    "Do not regenerate a full application; only initialize minimal scaffold files (package.json, dfx.json, index.html, frontend main entry).",
    "After initialization, stop and confirm file presence before any build/deploy attempt.",
    "No redesign, no new features, and no backend changes during this initialization."
  ],
  "known_issues": [
    "Workspace currently missing persisted project files from the previously generated/working build; requires controlled re-initialization of minimal structure."
  ],
  "isFixRequest": true,
  "existing_features": [
    {
      "id": "feature-ensure-the-frontend-entry-files-exist-and-are-valid-frontend-index-html-and-frontend-src-main-tsx-if-they-already-exist-do-not-modify-them-only-create-them-if-missing",
      "title": "Ensure the frontend entry files exist and are valid: frontend/index.html and frontend/src/main.tsx. If they already exist, do not modify them; only create them if missing.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Create a controlled minimal valid project structure (package.json, dfx.json, frontend index.html + main entry) and stop after confirming files exist; no redesign, no new features, no backend changes, no deployment attempt yet.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Create a minimal root-level package.json that is sufficient to install and build the existing React+TypeScript frontend without regenerating or rewriting any existing application source files.",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Create a minimal root-level dfx.json defining canisters for the existing backend and frontend assets, without changing any backend code and without attempting deployment.",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    },
    {
      "id": "AR-5",
      "summary": "After creating only the minimal structure files (package.json, dfx.json, and ensuring the frontend entry files exist), STOP and provide an explicit confirmation that these files physically exist in the workspace before any build attempt or further changes.",
      "reqIds": [
        "REQ-4"
      ],
      "status": "pending"
    }
  ],
  "projectName": "Controlled clean initialization: add minimal IC project files and stop for validation",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}